mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c3xh/common/s6e2c3xh.h
typedef struct stc_i2s_mcr0reg_field
{
    union {
        struct {
            __IO  uint32_t  S0WDL                :5;
            __IO  uint32_t  S0CHL                :5;
            __IO  uint32_t  S0CHN                :5;
            __IO  uint32_t  RESERVED0            :1;
            __IO  uint32_t  S1WDL                :5;
            __IO  uint32_t  S1CHL                :5;
            __IO  uint32_t  S1CHN                :5;
            __IO  uint32_t  RESERVED2            :1;
        };
        struct {
            __IO  uint32_t  S0WDL0               :1;
            __IO  uint32_t  S0WDL1               :1;
            __IO  uint32_t  S0WDL2               :1;
            __IO  uint32_t  S0WDL3               :1;
            __IO  uint32_t  S0WDL4               :1;
            __IO  uint32_t  S0CHL0               :1;
            __IO  uint32_t  S0CHL1               :1;
            __IO  uint32_t  S0CHL2               :1;
            __IO  uint32_t  S0CHL3               :1;
            __IO  uint32_t  S0CHL4               :1;
            __IO  uint32_t  S0CHN0               :1;
            __IO  uint32_t  S0CHN1               :1;
            __IO  uint32_t  S0CHN2               :1;
            __IO  uint32_t  S0CHN3               :1;
            __IO  uint32_t  S0CHN4               :1;
            __IO  uint32_t  RESERVED1            :1;
            __IO  uint32_t  S1WDL0               :1;
            __IO  uint32_t  S1WDL1               :1;
            __IO  uint32_t  S1WDL2               :1;
            __IO  uint32_t  S1WDL3               :1;
            __IO  uint32_t  S1WDL4               :1;
            __IO  uint32_t  S1CHL0               :1;
            __IO  uint32_t  S1CHL1               :1;
            __IO  uint32_t  S1CHL2               :1;
            __IO  uint32_t  S1CHL3               :1;
            __IO  uint32_t  S1CHL4               :1;
            __IO  uint32_t  S1CHN0               :1;
            __IO  uint32_t  S1CHN1               :1;
            __IO  uint32_t  S1CHN2               :1;
            __IO  uint32_t  S1CHN3               :1;
            __IO  uint32_t  S1CHN4               :1;
            __IO  uint32_t  RESERVED3            :1;
        };
    };
} stc_i2s_mcr0reg_field_t;

typedef struct stc_i2s_mcr1reg_field
{
        __IO  uint32_t  S0CH00                   :1;
        __IO  uint32_t  S0CH01                   :1;
        __IO  uint32_t  S0CH02                   :1;
        __IO  uint32_t  S0CH03                   :1;
        __IO  uint32_t  S0CH04                   :1;
        __IO  uint32_t  S0CH05                   :1;
        __IO  uint32_t  S0CH06                   :1;
        __IO  uint32_t  S0CH07                   :1;
        __IO  uint32_t  S0CH08                   :1;
        __IO  uint32_t  S0CH09                   :1;
        __IO  uint32_t  S0CH10                   :1;
        __IO  uint32_t  S0CH11                   :1;
        __IO  uint32_t  S0CH12                   :1;
        __IO  uint32_t  S0CH13                   :1;
        __IO  uint32_t  S0CH14                   :1;
        __IO  uint32_t  S0CH15                   :1;
        __IO  uint32_t  S0CH16                   :1;
        __IO  uint32_t  S0CH17                   :1;
        __IO  uint32_t  S0CH18                   :1;
        __IO  uint32_t  S0CH19                   :1;
        __IO  uint32_t  S0CH20                   :1;
        __IO  uint32_t  S0CH21                   :1;
        __IO  uint32_t  S0CH22                   :1;
        __IO  uint32_t  S0CH23                   :1;
        __IO  uint32_t  S0CH24                   :1;
        __IO  uint32_t  S0CH25                   :1;
        __IO  uint32_t  S0CH26                   :1;
        __IO  uint32_t  S0CH27                   :1;
        __IO  uint32_t  S0CH28                   :1;
        __IO  uint32_t  S0CH29                   :1;
        __IO  uint32_t  S0CH30                   :1;
        __IO  uint32_t  S0CH31                   :1;
} stc_i2s_mcr1reg_field_t;

typedef struct stc_i2s_mcr2reg_field
{
        __IO  uint32_t  S1CH00                   :1;
        __IO  uint32_t  S1CH01                   :1;
        __IO  uint32_t  S1CH02                   :1;
        __IO  uint32_t  S1CH03                   :1;
        __IO  uint32_t  S1CH04                   :1;
        __IO  uint32_t  S1CH05                   :1;
        __IO  uint32_t  S1CH06                   :1;
        __IO  uint32_t  S1CH07                   :1;
        __IO  uint32_t  S1CH08                   :1;
        __IO  uint32_t  S1CH09                   :1;
        __IO  uint32_t  S1CH10                   :1;
        __IO  uint32_t  S1CH11                   :1;
        __IO  uint32_t  S1CH12                   :1;
        __IO  uint32_t  S1CH13                   :1;
        __IO  uint32_t  S1CH14                   :1;
        __IO  uint32_t  S1CH15                   :1;
        __IO  uint32_t  S1CH16                   :1;
        __IO  uint32_t  S1CH17                   :1;
        __IO  uint32_t  S1CH18                   :1;
        __IO  uint32_t  S1CH19                   :1;
        __IO  uint32_t  S1CH20                   :1;
        __IO  uint32_t  S1CH21                   :1;
        __IO  uint32_t  S1CH22                   :1;
        __IO  uint32_t  S1CH23                   :1;
        __IO  uint32_t  S1CH24                   :1;
        __IO  uint32_t  S1CH25                   :1;
        __IO  uint32_t  S1CH26                   :1;
        __IO  uint32_t  S1CH27                   :1;
        __IO  uint32_t  S1CH28                   :1;
        __IO  uint32_t  S1CH29                   :1;
        __IO  uint32_t  S1CH30                   :1;
        __IO  uint32_t  S1CH31                   :1;
} stc_i2s_mcr2reg_field_t;

typedef struct stc_i2s_oprreg_field
{
        __IO  uint32_t  START                    :1;
        __IO  uint32_t  RESERVED0                :15;
        __IO  uint32_t  TXENB                    :1;
        __IO  uint32_t  RESERVED1                :7;
        __IO  uint32_t  RXENB                    :1;
        __IO  uint32_t  RESERVED2                :7;
} stc_i2s_oprreg_field_t;

typedef struct stc_i2s_srst_field
{
        __IO  uint32_t  SRST                     :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_i2s_srst_field_t;

typedef struct stc_i2s_intcnt_field
{
    union {
        struct {
            __IO  uint32_t  RFTH                 :4;
            __IO  uint32_t  RPTMR                :2;
            __IO  uint32_t  RESERVED0            :2;
            __IO  uint32_t  TFTH                 :4;
            __IO  uint32_t  RESERVED2            :4;
            __IO  uint32_t  RXFIM                :1;
            __IO  uint32_t  RXFDM                :1;
            __IO  uint32_t  EOPM                 :1;
            __IO  uint32_t  RXOVM                :1;
            __IO  uint32_t  RXUDM                :1;
            __IO  uint32_t  RBERM                :1;
            __IO  uint32_t  RESERVED3            :2;
            __IO  uint32_t  TXFIM                :1;
            __IO  uint32_t  TXFDM                :1;
            __IO  uint32_t  TXOVM                :1;
            __IO  uint32_t  TXUD0M               :1;
            __IO  uint32_t  FERRM                :1;
            __IO  uint32_t  TBERM                :1;
            __IO  uint32_t  TXUD1M               :1;
            __IO  uint32_t  RESERVED4            :1;
        };
        struct {
            __IO  uint32_t  RFTH0                :1;
            __IO  uint32_t  RFTH1                :1;
            __IO  uint32_t  RFTH2                :1;
            __IO  uint32_t  RFTH3                :1;
            __IO  uint32_t  RPTMR0               :1;
            __IO  uint32_t  RPTMR1               :1;
            __IO  uint32_t  RESERVED1            :2;
            __IO  uint32_t  TFTH0                :1;
            __IO  uint32_t  TFTH1                :1;
            __IO  uint32_t  TFTH2                :1;
            __IO  uint32_t  TFTH3                :1;
            __IO  uint32_t  RESERVED5            :20;
        };
    };
} stc_i2s_intcnt_field_t;

typedef struct stc_i2s_status_field
{
    union {
        struct {
            __IO  uint32_t  RXNUM                :8;
            __IO  uint32_t  TXNUM                :8;
            __IO  uint32_t  RXFI                 :1;
            __IO  uint32_t  TXFI                 :1;
            __IO  uint32_t  BSY                  :1;
            __IO  uint32_t  EOPI                 :1;
            __IO  uint32_t  RESERVED0            :4;
            __IO  uint32_t  RXOVR                :1;
            __IO  uint32_t  RXUDR                :1;
            __IO  uint32_t  TXOVR                :1;
            __IO  uint32_t  TXUDR0               :1;
            __IO  uint32_t  TXUDR1               :1;
            __IO  uint32_t  FERR                 :1;
            __IO  uint32_t  RBERR                :1;
            __IO  uint32_t  TBERR                :1;
        };
        struct {
            __IO  uint32_t  RXNUM0               :1;
            __IO  uint32_t  RXNUM1               :1;
            __IO  uint32_t  RXNUM2               :1;
            __IO  uint32_t  RXNUM3               :1;
            __IO  uint32_t  RXNUM4               :1;
            __IO  uint32_t  RXNUM5               :1;
            __IO  uint32_t  RXNUM6               :1;
            __IO  uint32_t  RXNUM7               :1;
            __IO  uint32_t  TXNUM0               :1;
            __IO  uint32_t  TXNUM1               :1;
            __IO  uint32_t  TXNUM2               :1;
            __IO  uint32_t  TXNUM3               :1;
            __IO  uint32_t  TXNUM4               :1;
            __IO  uint32_t  TXNUM5               :1;
            __IO  uint32_t  TXNUM6               :1;
            __IO  uint32_t  TXNUM7               :1;
            __IO  uint32_t  RESERVED1            :16;
        };
    };
} stc_i2s_status_field_t;

typedef struct stc_i2s_dmaact_field
{
        __IO  uint32_t  RDMACT                   :1;
        __IO  uint32_t  RESERVED0                :7;
        __IO  uint32_t  RL1E0                    :1;
        __IO  uint32_t  RESERVED1                :7;
        __IO  uint32_t  TDMACT                   :1;
        __IO  uint32_t  RESERVED2                :7;
        __IO  uint32_t  TL1E0                    :1;
        __IO  uint32_t  RESERVED3                :7;
} stc_i2s_dmaact_field_t;

typedef struct stc_i2s_tstreg_field
{
        __IO  uint32_t  LBMD                     :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_i2s_tstreg_field_t;

