mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c3xh/common/s6e2c3xh.h
/*******************************************************************************
* MFS Registers MFS12
*   Register Definition
*******************************************************************************/
#define FM_MFS12_CSIO_SMR                         *((volatile  uint8_t*)(0x40038C00UL))
#define FM4_MFS12_CSIO_SMR                        *((volatile  uint8_t*)(0x40038C00UL))
#define FM_MFS12_I2C_SMR                          *((volatile  uint8_t*)(0x40038C00UL))
#define FM4_MFS12_I2C_SMR                         *((volatile  uint8_t*)(0x40038C00UL))
#define FM_MFS12_LIN_SMR                          *((volatile  uint8_t*)(0x40038C00UL))
#define FM4_MFS12_LIN_SMR                         *((volatile  uint8_t*)(0x40038C00UL))
#define FM_MFS12_UART_SMR                         *((volatile  uint8_t*)(0x40038C00UL))
#define FM4_MFS12_UART_SMR                        *((volatile  uint8_t*)(0x40038C00UL))
#define FM_MFS12_CSIO_SCR                         *((volatile  uint8_t*)(0x40038C01UL))
#define FM4_MFS12_CSIO_SCR                        *((volatile  uint8_t*)(0x40038C01UL))
#define FM_MFS12_I2C_IBCR                         *((volatile  uint8_t*)(0x40038C01UL))
#define FM4_MFS12_I2C_IBCR                        *((volatile  uint8_t*)(0x40038C01UL))
#define FM_MFS12_LIN_SCR                          *((volatile  uint8_t*)(0x40038C01UL))
#define FM4_MFS12_LIN_SCR                         *((volatile  uint8_t*)(0x40038C01UL))
#define FM_MFS12_UART_SCR                         *((volatile  uint8_t*)(0x40038C01UL))
#define FM4_MFS12_UART_SCR                        *((volatile  uint8_t*)(0x40038C01UL))
#define FM_MFS12_CSIO_ESCR                        *((volatile  uint8_t*)(0x40038C04UL))
#define FM4_MFS12_CSIO_ESCR                       *((volatile  uint8_t*)(0x40038C04UL))
#define FM_MFS12_I2C_IBSR                         *((volatile  uint8_t*)(0x40038C04UL))
#define FM4_MFS12_I2C_IBSR                        *((volatile  uint8_t*)(0x40038C04UL))
#define FM_MFS12_LIN_ESCR                         *((volatile  uint8_t*)(0x40038C04UL))
#define FM4_MFS12_LIN_ESCR                        *((volatile  uint8_t*)(0x40038C04UL))
#define FM_MFS12_UART_ESCR                        *((volatile  uint8_t*)(0x40038C04UL))
#define FM4_MFS12_UART_ESCR                       *((volatile  uint8_t*)(0x40038C04UL))
#define FM_MFS12_CSIO_SSR                         *((volatile  uint8_t*)(0x40038C05UL))
#define FM4_MFS12_CSIO_SSR                        *((volatile  uint8_t*)(0x40038C05UL))
#define FM_MFS12_I2C_SSR                          *((volatile  uint8_t*)(0x40038C05UL))
#define FM4_MFS12_I2C_SSR                         *((volatile  uint8_t*)(0x40038C05UL))
#define FM_MFS12_LIN_SSR                          *((volatile  uint8_t*)(0x40038C05UL))
#define FM4_MFS12_LIN_SSR                         *((volatile  uint8_t*)(0x40038C05UL))
#define FM_MFS12_UART_SSR                         *((volatile  uint8_t*)(0x40038C05UL))
#define FM4_MFS12_UART_SSR                        *((volatile  uint8_t*)(0x40038C05UL))
#define FM_MFS12_CSIO_RDR                         *((volatile uint16_t*)(0x40038C08UL))
#define FM4_MFS12_CSIO_RDR                        *((volatile uint16_t*)(0x40038C08UL))
#define FM_MFS12_CSIO_TDR                         *((volatile uint16_t*)(0x40038C08UL))
#define FM4_MFS12_CSIO_TDR                        *((volatile uint16_t*)(0x40038C08UL))
#define FM_MFS12_I2C_RDR                          *((volatile uint16_t*)(0x40038C08UL))
#define FM4_MFS12_I2C_RDR                         *((volatile uint16_t*)(0x40038C08UL))
#define FM_MFS12_I2C_TDR                          *((volatile uint16_t*)(0x40038C08UL))
#define FM4_MFS12_I2C_TDR                         *((volatile uint16_t*)(0x40038C08UL))
#define FM_MFS12_LIN_RDR                          *((volatile uint16_t*)(0x40038C08UL))
#define FM4_MFS12_LIN_RDR                         *((volatile uint16_t*)(0x40038C08UL))
#define FM_MFS12_LIN_TDR                          *((volatile uint16_t*)(0x40038C08UL))
#define FM4_MFS12_LIN_TDR                         *((volatile uint16_t*)(0x40038C08UL))
#define FM_MFS12_UART_RDR                         *((volatile uint16_t*)(0x40038C08UL))
#define FM4_MFS12_UART_RDR                        *((volatile uint16_t*)(0x40038C08UL))
#define FM_MFS12_UART_TDR                         *((volatile uint16_t*)(0x40038C08UL))
#define FM4_MFS12_UART_TDR                        *((volatile uint16_t*)(0x40038C08UL))
#define FM_MFS12_CSIO_BGR                         *((volatile uint16_t*)(0x40038C0CUL))
#define FM4_MFS12_CSIO_BGR                        *((volatile uint16_t*)(0x40038C0CUL))
#define FM_MFS12_I2C_BGR                          *((volatile uint16_t*)(0x40038C0CUL))
#define FM4_MFS12_I2C_BGR                         *((volatile uint16_t*)(0x40038C0CUL))
#define FM_MFS12_LIN_BGR                          *((volatile uint16_t*)(0x40038C0CUL))
#define FM4_MFS12_LIN_BGR                         *((volatile uint16_t*)(0x40038C0CUL))
#define FM_MFS12_UART_BGR                         *((volatile uint16_t*)(0x40038C0CUL))
#define FM4_MFS12_UART_BGR                        *((volatile uint16_t*)(0x40038C0CUL))
#define FM_MFS12_I2C_ISBA                         *((volatile  uint8_t*)(0x40038C10UL))
#define FM4_MFS12_I2C_ISBA                        *((volatile  uint8_t*)(0x40038C10UL))
#define FM_MFS12_I2C_ISMK                         *((volatile  uint8_t*)(0x40038C11UL))
#define FM4_MFS12_I2C_ISMK                        *((volatile  uint8_t*)(0x40038C11UL))
#define FM_MFS12_CSIO_FCR                         *((volatile uint16_t*)(0x40038C14UL))
#define FM4_MFS12_CSIO_FCR                        *((volatile uint16_t*)(0x40038C14UL))
#define FM_MFS12_I2C_FCR                          *((volatile uint16_t*)(0x40038C14UL))
#define FM4_MFS12_I2C_FCR                         *((volatile uint16_t*)(0x40038C14UL))
#define FM_MFS12_LIN_FCR                          *((volatile uint16_t*)(0x40038C14UL))
#define FM4_MFS12_LIN_FCR                         *((volatile uint16_t*)(0x40038C14UL))
#define FM_MFS12_UART_FCR                         *((volatile uint16_t*)(0x40038C14UL))
#define FM4_MFS12_UART_FCR                        *((volatile uint16_t*)(0x40038C14UL))
#define FM_MFS12_CSIO_FBYTE1                      *((volatile  uint8_t*)(0x40038C18UL))
#define FM4_MFS12_CSIO_FBYTE1                     *((volatile  uint8_t*)(0x40038C18UL))
#define FM_MFS12_I2C_FBYTE1                       *((volatile  uint8_t*)(0x40038C18UL))
#define FM4_MFS12_I2C_FBYTE1                      *((volatile  uint8_t*)(0x40038C18UL))
#define FM_MFS12_LIN_FBYTE1                       *((volatile  uint8_t*)(0x40038C18UL))
#define FM4_MFS12_LIN_FBYTE1                      *((volatile  uint8_t*)(0x40038C18UL))
#define FM_MFS12_UART_FBYTE1                      *((volatile  uint8_t*)(0x40038C18UL))
#define FM4_MFS12_UART_FBYTE1                     *((volatile  uint8_t*)(0x40038C18UL))
#define FM_MFS12_CSIO_FBYTE2                      *((volatile  uint8_t*)(0x40038C19UL))
#define FM4_MFS12_CSIO_FBYTE2                     *((volatile  uint8_t*)(0x40038C19UL))
#define FM_MFS12_I2C_FBYTE2                       *((volatile  uint8_t*)(0x40038C19UL))
#define FM4_MFS12_I2C_FBYTE2                      *((volatile  uint8_t*)(0x40038C19UL))
#define FM_MFS12_LIN_FBYTE2                       *((volatile  uint8_t*)(0x40038C19UL))
#define FM4_MFS12_LIN_FBYTE2                      *((volatile  uint8_t*)(0x40038C19UL))
#define FM_MFS12_UART_FBYTE2                      *((volatile  uint8_t*)(0x40038C19UL))
#define FM4_MFS12_UART_FBYTE2                     *((volatile  uint8_t*)(0x40038C19UL))
#define FM_MFS12_CSIO_SCSTR0                      *((volatile  uint8_t*)(0x40038C1CUL))
#define FM4_MFS12_CSIO_SCSTR0                     *((volatile  uint8_t*)(0x40038C1CUL))
#define FM_MFS12_I2C_NFCR                         *((volatile  uint8_t*)(0x40038C1CUL))
#define FM4_MFS12_I2C_NFCR                        *((volatile  uint8_t*)(0x40038C1CUL))
#define FM_MFS12_CSIO_SCSTR1                      *((volatile  uint8_t*)(0x40038C1DUL))
#define FM4_MFS12_CSIO_SCSTR1                     *((volatile  uint8_t*)(0x40038C1DUL))
#define FM_MFS12_I2C_EIBCR                        *((volatile  uint8_t*)(0x40038C1DUL))
#define FM4_MFS12_I2C_EIBCR                       *((volatile  uint8_t*)(0x40038C1DUL))
#define FM_MFS12_CSIO_SCSTR32                     *((volatile uint16_t*)(0x40038C20UL))
#define FM4_MFS12_CSIO_SCSTR32                    *((volatile uint16_t*)(0x40038C20UL))
#define FM_MFS12_CSIO_SACSR                       *((volatile uint16_t*)(0x40038C24UL))
#define FM4_MFS12_CSIO_SACSR                      *((volatile uint16_t*)(0x40038C24UL))
#define FM_MFS12_CSIO_STMR                        *((volatile uint16_t*)(0x40038C28UL))
#define FM4_MFS12_CSIO_STMR                       *((volatile uint16_t*)(0x40038C28UL))
#define FM_MFS12_CSIO_STMCR                       *((volatile uint16_t*)(0x40038C2CUL))
#define FM4_MFS12_CSIO_STMCR                      *((volatile uint16_t*)(0x40038C2CUL))
#define FM_MFS12_CSIO_SCSCR                       *((volatile uint16_t*)(0x40038C30UL))
#define FM4_MFS12_CSIO_SCSCR                      *((volatile uint16_t*)(0x40038C30UL))
#define FM_MFS12_CSIO_SCSFR0                      *((volatile  uint8_t*)(0x40038C34UL))
#define FM4_MFS12_CSIO_SCSFR0                     *((volatile  uint8_t*)(0x40038C34UL))
#define FM_MFS12_CSIO_SCSFR1                      *((volatile  uint8_t*)(0x40038C35UL))
#define FM4_MFS12_CSIO_SCSFR1                     *((volatile  uint8_t*)(0x40038C35UL))
#define FM_MFS12_CSIO_SCSFR2                      *((volatile  uint8_t*)(0x40038C38UL))
#define FM4_MFS12_CSIO_SCSFR2                     *((volatile  uint8_t*)(0x40038C38UL))
#define FM_MFS12_CSIO_TBYTE0                      *((volatile  uint8_t*)(0x40038C3CUL))
#define FM4_MFS12_CSIO_TBYTE0                     *((volatile  uint8_t*)(0x40038C3CUL))
#define FM_MFS12_CSIO_TBYTE1                      *((volatile  uint8_t*)(0x40038C3DUL))
#define FM4_MFS12_CSIO_TBYTE1                     *((volatile  uint8_t*)(0x40038C3DUL))
#define FM_MFS12_CSIO_TBYTE2                      *((volatile  uint8_t*)(0x40038C40UL))
#define FM4_MFS12_CSIO_TBYTE2                     *((volatile  uint8_t*)(0x40038C40UL))
#define FM_MFS12_CSIO_TBYTE3                      *((volatile  uint8_t*)(0x40038C41UL))
#define FM4_MFS12_CSIO_TBYTE3                     *((volatile  uint8_t*)(0x40038C41UL))

