mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c3xh/common/s6e2c3xh.h
/*******************************************************************************
* MFS Registers MFS15
*   Register Definition
*******************************************************************************/
#define FM_MFS15_CSIO_SMR                         *((volatile  uint8_t*)(0x40038F00UL))
#define FM4_MFS15_CSIO_SMR                        *((volatile  uint8_t*)(0x40038F00UL))
#define FM_MFS15_I2C_SMR                          *((volatile  uint8_t*)(0x40038F00UL))
#define FM4_MFS15_I2C_SMR                         *((volatile  uint8_t*)(0x40038F00UL))
#define FM_MFS15_LIN_SMR                          *((volatile  uint8_t*)(0x40038F00UL))
#define FM4_MFS15_LIN_SMR                         *((volatile  uint8_t*)(0x40038F00UL))
#define FM_MFS15_UART_SMR                         *((volatile  uint8_t*)(0x40038F00UL))
#define FM4_MFS15_UART_SMR                        *((volatile  uint8_t*)(0x40038F00UL))
#define FM_MFS15_CSIO_SCR                         *((volatile  uint8_t*)(0x40038F01UL))
#define FM4_MFS15_CSIO_SCR                        *((volatile  uint8_t*)(0x40038F01UL))
#define FM_MFS15_I2C_IBCR                         *((volatile  uint8_t*)(0x40038F01UL))
#define FM4_MFS15_I2C_IBCR                        *((volatile  uint8_t*)(0x40038F01UL))
#define FM_MFS15_LIN_SCR                          *((volatile  uint8_t*)(0x40038F01UL))
#define FM4_MFS15_LIN_SCR                         *((volatile  uint8_t*)(0x40038F01UL))
#define FM_MFS15_UART_SCR                         *((volatile  uint8_t*)(0x40038F01UL))
#define FM4_MFS15_UART_SCR                        *((volatile  uint8_t*)(0x40038F01UL))
#define FM_MFS15_CSIO_ESCR                        *((volatile  uint8_t*)(0x40038F04UL))
#define FM4_MFS15_CSIO_ESCR                       *((volatile  uint8_t*)(0x40038F04UL))
#define FM_MFS15_I2C_IBSR                         *((volatile  uint8_t*)(0x40038F04UL))
#define FM4_MFS15_I2C_IBSR                        *((volatile  uint8_t*)(0x40038F04UL))
#define FM_MFS15_LIN_ESCR                         *((volatile  uint8_t*)(0x40038F04UL))
#define FM4_MFS15_LIN_ESCR                        *((volatile  uint8_t*)(0x40038F04UL))
#define FM_MFS15_UART_ESCR                        *((volatile  uint8_t*)(0x40038F04UL))
#define FM4_MFS15_UART_ESCR                       *((volatile  uint8_t*)(0x40038F04UL))
#define FM_MFS15_CSIO_SSR                         *((volatile  uint8_t*)(0x40038F05UL))
#define FM4_MFS15_CSIO_SSR                        *((volatile  uint8_t*)(0x40038F05UL))
#define FM_MFS15_I2C_SSR                          *((volatile  uint8_t*)(0x40038F05UL))
#define FM4_MFS15_I2C_SSR                         *((volatile  uint8_t*)(0x40038F05UL))
#define FM_MFS15_LIN_SSR                          *((volatile  uint8_t*)(0x40038F05UL))
#define FM4_MFS15_LIN_SSR                         *((volatile  uint8_t*)(0x40038F05UL))
#define FM_MFS15_UART_SSR                         *((volatile  uint8_t*)(0x40038F05UL))
#define FM4_MFS15_UART_SSR                        *((volatile  uint8_t*)(0x40038F05UL))
#define FM_MFS15_CSIO_RDR                         *((volatile uint16_t*)(0x40038F08UL))
#define FM4_MFS15_CSIO_RDR                        *((volatile uint16_t*)(0x40038F08UL))
#define FM_MFS15_CSIO_TDR                         *((volatile uint16_t*)(0x40038F08UL))
#define FM4_MFS15_CSIO_TDR                        *((volatile uint16_t*)(0x40038F08UL))
#define FM_MFS15_I2C_RDR                          *((volatile uint16_t*)(0x40038F08UL))
#define FM4_MFS15_I2C_RDR                         *((volatile uint16_t*)(0x40038F08UL))
#define FM_MFS15_I2C_TDR                          *((volatile uint16_t*)(0x40038F08UL))
#define FM4_MFS15_I2C_TDR                         *((volatile uint16_t*)(0x40038F08UL))
#define FM_MFS15_LIN_RDR                          *((volatile uint16_t*)(0x40038F08UL))
#define FM4_MFS15_LIN_RDR                         *((volatile uint16_t*)(0x40038F08UL))
#define FM_MFS15_LIN_TDR                          *((volatile uint16_t*)(0x40038F08UL))
#define FM4_MFS15_LIN_TDR                         *((volatile uint16_t*)(0x40038F08UL))
#define FM_MFS15_UART_RDR                         *((volatile uint16_t*)(0x40038F08UL))
#define FM4_MFS15_UART_RDR                        *((volatile uint16_t*)(0x40038F08UL))
#define FM_MFS15_UART_TDR                         *((volatile uint16_t*)(0x40038F08UL))
#define FM4_MFS15_UART_TDR                        *((volatile uint16_t*)(0x40038F08UL))
#define FM_MFS15_CSIO_BGR                         *((volatile uint16_t*)(0x40038F0CUL))
#define FM4_MFS15_CSIO_BGR                        *((volatile uint16_t*)(0x40038F0CUL))
#define FM_MFS15_I2C_BGR                          *((volatile uint16_t*)(0x40038F0CUL))
#define FM4_MFS15_I2C_BGR                         *((volatile uint16_t*)(0x40038F0CUL))
#define FM_MFS15_LIN_BGR                          *((volatile uint16_t*)(0x40038F0CUL))
#define FM4_MFS15_LIN_BGR                         *((volatile uint16_t*)(0x40038F0CUL))
#define FM_MFS15_UART_BGR                         *((volatile uint16_t*)(0x40038F0CUL))
#define FM4_MFS15_UART_BGR                        *((volatile uint16_t*)(0x40038F0CUL))
#define FM_MFS15_I2C_ISBA                         *((volatile  uint8_t*)(0x40038F10UL))
#define FM4_MFS15_I2C_ISBA                        *((volatile  uint8_t*)(0x40038F10UL))
#define FM_MFS15_I2C_ISMK                         *((volatile  uint8_t*)(0x40038F11UL))
#define FM4_MFS15_I2C_ISMK                        *((volatile  uint8_t*)(0x40038F11UL))
#define FM_MFS15_CSIO_FCR                         *((volatile uint16_t*)(0x40038F14UL))
#define FM4_MFS15_CSIO_FCR                        *((volatile uint16_t*)(0x40038F14UL))
#define FM_MFS15_I2C_FCR                          *((volatile uint16_t*)(0x40038F14UL))
#define FM4_MFS15_I2C_FCR                         *((volatile uint16_t*)(0x40038F14UL))
#define FM_MFS15_LIN_FCR                          *((volatile uint16_t*)(0x40038F14UL))
#define FM4_MFS15_LIN_FCR                         *((volatile uint16_t*)(0x40038F14UL))
#define FM_MFS15_UART_FCR                         *((volatile uint16_t*)(0x40038F14UL))
#define FM4_MFS15_UART_FCR                        *((volatile uint16_t*)(0x40038F14UL))
#define FM_MFS15_CSIO_FBYTE1                      *((volatile  uint8_t*)(0x40038F18UL))
#define FM4_MFS15_CSIO_FBYTE1                     *((volatile  uint8_t*)(0x40038F18UL))
#define FM_MFS15_I2C_FBYTE1                       *((volatile  uint8_t*)(0x40038F18UL))
#define FM4_MFS15_I2C_FBYTE1                      *((volatile  uint8_t*)(0x40038F18UL))
#define FM_MFS15_LIN_FBYTE1                       *((volatile  uint8_t*)(0x40038F18UL))
#define FM4_MFS15_LIN_FBYTE1                      *((volatile  uint8_t*)(0x40038F18UL))
#define FM_MFS15_UART_FBYTE1                      *((volatile  uint8_t*)(0x40038F18UL))
#define FM4_MFS15_UART_FBYTE1                     *((volatile  uint8_t*)(0x40038F18UL))
#define FM_MFS15_CSIO_FBYTE2                      *((volatile  uint8_t*)(0x40038F19UL))
#define FM4_MFS15_CSIO_FBYTE2                     *((volatile  uint8_t*)(0x40038F19UL))
#define FM_MFS15_I2C_FBYTE2                       *((volatile  uint8_t*)(0x40038F19UL))
#define FM4_MFS15_I2C_FBYTE2                      *((volatile  uint8_t*)(0x40038F19UL))
#define FM_MFS15_LIN_FBYTE2                       *((volatile  uint8_t*)(0x40038F19UL))
#define FM4_MFS15_LIN_FBYTE2                      *((volatile  uint8_t*)(0x40038F19UL))
#define FM_MFS15_UART_FBYTE2                      *((volatile  uint8_t*)(0x40038F19UL))
#define FM4_MFS15_UART_FBYTE2                     *((volatile  uint8_t*)(0x40038F19UL))
#define FM_MFS15_CSIO_SCSTR0                      *((volatile  uint8_t*)(0x40038F1CUL))
#define FM4_MFS15_CSIO_SCSTR0                     *((volatile  uint8_t*)(0x40038F1CUL))
#define FM_MFS15_I2C_NFCR                         *((volatile  uint8_t*)(0x40038F1CUL))
#define FM4_MFS15_I2C_NFCR                        *((volatile  uint8_t*)(0x40038F1CUL))
#define FM_MFS15_CSIO_SCSTR1                      *((volatile  uint8_t*)(0x40038F1DUL))
#define FM4_MFS15_CSIO_SCSTR1                     *((volatile  uint8_t*)(0x40038F1DUL))
#define FM_MFS15_I2C_EIBCR                        *((volatile  uint8_t*)(0x40038F1DUL))
#define FM4_MFS15_I2C_EIBCR                       *((volatile  uint8_t*)(0x40038F1DUL))
#define FM_MFS15_CSIO_SCSTR32                     *((volatile uint16_t*)(0x40038F20UL))
#define FM4_MFS15_CSIO_SCSTR32                    *((volatile uint16_t*)(0x40038F20UL))
#define FM_MFS15_CSIO_SACSR                       *((volatile uint16_t*)(0x40038F24UL))
#define FM4_MFS15_CSIO_SACSR                      *((volatile uint16_t*)(0x40038F24UL))
#define FM_MFS15_CSIO_STMR                        *((volatile uint16_t*)(0x40038F28UL))
#define FM4_MFS15_CSIO_STMR                       *((volatile uint16_t*)(0x40038F28UL))
#define FM_MFS15_CSIO_STMCR                       *((volatile uint16_t*)(0x40038F2CUL))
#define FM4_MFS15_CSIO_STMCR                      *((volatile uint16_t*)(0x40038F2CUL))
#define FM_MFS15_CSIO_SCSCR                       *((volatile uint16_t*)(0x40038F30UL))
#define FM4_MFS15_CSIO_SCSCR                      *((volatile uint16_t*)(0x40038F30UL))
#define FM_MFS15_CSIO_SCSFR0                      *((volatile  uint8_t*)(0x40038F34UL))
#define FM4_MFS15_CSIO_SCSFR0                     *((volatile  uint8_t*)(0x40038F34UL))
#define FM_MFS15_CSIO_SCSFR1                      *((volatile  uint8_t*)(0x40038F35UL))
#define FM4_MFS15_CSIO_SCSFR1                     *((volatile  uint8_t*)(0x40038F35UL))
#define FM_MFS15_CSIO_SCSFR2                      *((volatile  uint8_t*)(0x40038F38UL))
#define FM4_MFS15_CSIO_SCSFR2                     *((volatile  uint8_t*)(0x40038F38UL))
#define FM_MFS15_CSIO_TBYTE0                      *((volatile  uint8_t*)(0x40038F3CUL))
#define FM4_MFS15_CSIO_TBYTE0                     *((volatile  uint8_t*)(0x40038F3CUL))
#define FM_MFS15_CSIO_TBYTE1                      *((volatile  uint8_t*)(0x40038F3DUL))
#define FM4_MFS15_CSIO_TBYTE1                     *((volatile  uint8_t*)(0x40038F3DUL))
#define FM_MFS15_CSIO_TBYTE2                      *((volatile  uint8_t*)(0x40038F40UL))
#define FM4_MFS15_CSIO_TBYTE2                     *((volatile  uint8_t*)(0x40038F40UL))
#define FM_MFS15_CSIO_TBYTE3                      *((volatile  uint8_t*)(0x40038F41UL))
#define FM4_MFS15_CSIO_TBYTE3                     *((volatile  uint8_t*)(0x40038F41UL))

