mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c3xh/common/s6e2c3xh.h
/*******************************************************************************
* MFS Registers MFS8
*   Register Definition
*******************************************************************************/
#define FM_MFS8_CSIO_SMR                          *((volatile  uint8_t*)(0x40038800UL))
#define FM4_MFS8_CSIO_SMR                         *((volatile  uint8_t*)(0x40038800UL))
#define FM_MFS8_I2C_SMR                           *((volatile  uint8_t*)(0x40038800UL))
#define FM4_MFS8_I2C_SMR                          *((volatile  uint8_t*)(0x40038800UL))
#define FM_MFS8_LIN_SMR                           *((volatile  uint8_t*)(0x40038800UL))
#define FM4_MFS8_LIN_SMR                          *((volatile  uint8_t*)(0x40038800UL))
#define FM_MFS8_UART_SMR                          *((volatile  uint8_t*)(0x40038800UL))
#define FM4_MFS8_UART_SMR                         *((volatile  uint8_t*)(0x40038800UL))
#define FM_MFS8_CSIO_SCR                          *((volatile  uint8_t*)(0x40038801UL))
#define FM4_MFS8_CSIO_SCR                         *((volatile  uint8_t*)(0x40038801UL))
#define FM_MFS8_I2C_IBCR                          *((volatile  uint8_t*)(0x40038801UL))
#define FM4_MFS8_I2C_IBCR                         *((volatile  uint8_t*)(0x40038801UL))
#define FM_MFS8_LIN_SCR                           *((volatile  uint8_t*)(0x40038801UL))
#define FM4_MFS8_LIN_SCR                          *((volatile  uint8_t*)(0x40038801UL))
#define FM_MFS8_UART_SCR                          *((volatile  uint8_t*)(0x40038801UL))
#define FM4_MFS8_UART_SCR                         *((volatile  uint8_t*)(0x40038801UL))
#define FM_MFS8_CSIO_ESCR                         *((volatile  uint8_t*)(0x40038804UL))
#define FM4_MFS8_CSIO_ESCR                        *((volatile  uint8_t*)(0x40038804UL))
#define FM_MFS8_I2C_IBSR                          *((volatile  uint8_t*)(0x40038804UL))
#define FM4_MFS8_I2C_IBSR                         *((volatile  uint8_t*)(0x40038804UL))
#define FM_MFS8_LIN_ESCR                          *((volatile  uint8_t*)(0x40038804UL))
#define FM4_MFS8_LIN_ESCR                         *((volatile  uint8_t*)(0x40038804UL))
#define FM_MFS8_UART_ESCR                         *((volatile  uint8_t*)(0x40038804UL))
#define FM4_MFS8_UART_ESCR                        *((volatile  uint8_t*)(0x40038804UL))
#define FM_MFS8_CSIO_SSR                          *((volatile  uint8_t*)(0x40038805UL))
#define FM4_MFS8_CSIO_SSR                         *((volatile  uint8_t*)(0x40038805UL))
#define FM_MFS8_I2C_SSR                           *((volatile  uint8_t*)(0x40038805UL))
#define FM4_MFS8_I2C_SSR                          *((volatile  uint8_t*)(0x40038805UL))
#define FM_MFS8_LIN_SSR                           *((volatile  uint8_t*)(0x40038805UL))
#define FM4_MFS8_LIN_SSR                          *((volatile  uint8_t*)(0x40038805UL))
#define FM_MFS8_UART_SSR                          *((volatile  uint8_t*)(0x40038805UL))
#define FM4_MFS8_UART_SSR                         *((volatile  uint8_t*)(0x40038805UL))
#define FM_MFS8_CSIO_RDR                          *((volatile uint16_t*)(0x40038808UL))
#define FM4_MFS8_CSIO_RDR                         *((volatile uint16_t*)(0x40038808UL))
#define FM_MFS8_CSIO_TDR                          *((volatile uint16_t*)(0x40038808UL))
#define FM4_MFS8_CSIO_TDR                         *((volatile uint16_t*)(0x40038808UL))
#define FM_MFS8_I2C_RDR                           *((volatile uint16_t*)(0x40038808UL))
#define FM4_MFS8_I2C_RDR                          *((volatile uint16_t*)(0x40038808UL))
#define FM_MFS8_I2C_TDR                           *((volatile uint16_t*)(0x40038808UL))
#define FM4_MFS8_I2C_TDR                          *((volatile uint16_t*)(0x40038808UL))
#define FM_MFS8_LIN_RDR                           *((volatile uint16_t*)(0x40038808UL))
#define FM4_MFS8_LIN_RDR                          *((volatile uint16_t*)(0x40038808UL))
#define FM_MFS8_LIN_TDR                           *((volatile uint16_t*)(0x40038808UL))
#define FM4_MFS8_LIN_TDR                          *((volatile uint16_t*)(0x40038808UL))
#define FM_MFS8_UART_RDR                          *((volatile uint16_t*)(0x40038808UL))
#define FM4_MFS8_UART_RDR                         *((volatile uint16_t*)(0x40038808UL))
#define FM_MFS8_UART_TDR                          *((volatile uint16_t*)(0x40038808UL))
#define FM4_MFS8_UART_TDR                         *((volatile uint16_t*)(0x40038808UL))
#define FM_MFS8_CSIO_BGR                          *((volatile uint16_t*)(0x4003880CUL))
#define FM4_MFS8_CSIO_BGR                         *((volatile uint16_t*)(0x4003880CUL))
#define FM_MFS8_I2C_BGR                           *((volatile uint16_t*)(0x4003880CUL))
#define FM4_MFS8_I2C_BGR                          *((volatile uint16_t*)(0x4003880CUL))
#define FM_MFS8_LIN_BGR                           *((volatile uint16_t*)(0x4003880CUL))
#define FM4_MFS8_LIN_BGR                          *((volatile uint16_t*)(0x4003880CUL))
#define FM_MFS8_UART_BGR                          *((volatile uint16_t*)(0x4003880CUL))
#define FM4_MFS8_UART_BGR                         *((volatile uint16_t*)(0x4003880CUL))
#define FM_MFS8_I2C_ISBA                          *((volatile  uint8_t*)(0x40038810UL))
#define FM4_MFS8_I2C_ISBA                         *((volatile  uint8_t*)(0x40038810UL))
#define FM_MFS8_I2C_ISMK                          *((volatile  uint8_t*)(0x40038811UL))
#define FM4_MFS8_I2C_ISMK                         *((volatile  uint8_t*)(0x40038811UL))
#define FM_MFS8_CSIO_FCR                          *((volatile uint16_t*)(0x40038814UL))
#define FM4_MFS8_CSIO_FCR                         *((volatile uint16_t*)(0x40038814UL))
#define FM_MFS8_I2C_FCR                           *((volatile uint16_t*)(0x40038814UL))
#define FM4_MFS8_I2C_FCR                          *((volatile uint16_t*)(0x40038814UL))
#define FM_MFS8_LIN_FCR                           *((volatile uint16_t*)(0x40038814UL))
#define FM4_MFS8_LIN_FCR                          *((volatile uint16_t*)(0x40038814UL))
#define FM_MFS8_UART_FCR                          *((volatile uint16_t*)(0x40038814UL))
#define FM4_MFS8_UART_FCR                         *((volatile uint16_t*)(0x40038814UL))
#define FM_MFS8_CSIO_FBYTE1                       *((volatile  uint8_t*)(0x40038818UL))
#define FM4_MFS8_CSIO_FBYTE1                      *((volatile  uint8_t*)(0x40038818UL))
#define FM_MFS8_I2C_FBYTE1                        *((volatile  uint8_t*)(0x40038818UL))
#define FM4_MFS8_I2C_FBYTE1                       *((volatile  uint8_t*)(0x40038818UL))
#define FM_MFS8_LIN_FBYTE1                        *((volatile  uint8_t*)(0x40038818UL))
#define FM4_MFS8_LIN_FBYTE1                       *((volatile  uint8_t*)(0x40038818UL))
#define FM_MFS8_UART_FBYTE1                       *((volatile  uint8_t*)(0x40038818UL))
#define FM4_MFS8_UART_FBYTE1                      *((volatile  uint8_t*)(0x40038818UL))
#define FM_MFS8_CSIO_FBYTE2                       *((volatile  uint8_t*)(0x40038819UL))
#define FM4_MFS8_CSIO_FBYTE2                      *((volatile  uint8_t*)(0x40038819UL))
#define FM_MFS8_I2C_FBYTE2                        *((volatile  uint8_t*)(0x40038819UL))
#define FM4_MFS8_I2C_FBYTE2                       *((volatile  uint8_t*)(0x40038819UL))
#define FM_MFS8_LIN_FBYTE2                        *((volatile  uint8_t*)(0x40038819UL))
#define FM4_MFS8_LIN_FBYTE2                       *((volatile  uint8_t*)(0x40038819UL))
#define FM_MFS8_UART_FBYTE2                       *((volatile  uint8_t*)(0x40038819UL))
#define FM4_MFS8_UART_FBYTE2                      *((volatile  uint8_t*)(0x40038819UL))
#define FM_MFS8_CSIO_SCSTR0                       *((volatile  uint8_t*)(0x4003881CUL))
#define FM4_MFS8_CSIO_SCSTR0                      *((volatile  uint8_t*)(0x4003881CUL))
#define FM_MFS8_I2C_NFCR                          *((volatile  uint8_t*)(0x4003881CUL))
#define FM4_MFS8_I2C_NFCR                         *((volatile  uint8_t*)(0x4003881CUL))
#define FM_MFS8_CSIO_SCSTR1                       *((volatile  uint8_t*)(0x4003881DUL))
#define FM4_MFS8_CSIO_SCSTR1                      *((volatile  uint8_t*)(0x4003881DUL))
#define FM_MFS8_I2C_EIBCR                         *((volatile  uint8_t*)(0x4003881DUL))
#define FM4_MFS8_I2C_EIBCR                        *((volatile  uint8_t*)(0x4003881DUL))
#define FM_MFS8_CSIO_SCSTR32                      *((volatile uint16_t*)(0x40038820UL))
#define FM4_MFS8_CSIO_SCSTR32                     *((volatile uint16_t*)(0x40038820UL))
#define FM_MFS8_CSIO_SACSR                        *((volatile uint16_t*)(0x40038824UL))
#define FM4_MFS8_CSIO_SACSR                       *((volatile uint16_t*)(0x40038824UL))
#define FM_MFS8_CSIO_STMR                         *((volatile uint16_t*)(0x40038828UL))
#define FM4_MFS8_CSIO_STMR                        *((volatile uint16_t*)(0x40038828UL))
#define FM_MFS8_CSIO_STMCR                        *((volatile uint16_t*)(0x4003882CUL))
#define FM4_MFS8_CSIO_STMCR                       *((volatile uint16_t*)(0x4003882CUL))
#define FM_MFS8_CSIO_SCSCR                        *((volatile uint16_t*)(0x40038830UL))
#define FM4_MFS8_CSIO_SCSCR                       *((volatile uint16_t*)(0x40038830UL))
#define FM_MFS8_CSIO_SCSFR0                       *((volatile  uint8_t*)(0x40038834UL))
#define FM4_MFS8_CSIO_SCSFR0                      *((volatile  uint8_t*)(0x40038834UL))
#define FM_MFS8_CSIO_SCSFR1                       *((volatile  uint8_t*)(0x40038835UL))
#define FM4_MFS8_CSIO_SCSFR1                      *((volatile  uint8_t*)(0x40038835UL))
#define FM_MFS8_CSIO_SCSFR2                       *((volatile  uint8_t*)(0x40038838UL))
#define FM4_MFS8_CSIO_SCSFR2                      *((volatile  uint8_t*)(0x40038838UL))
#define FM_MFS8_CSIO_TBYTE0                       *((volatile  uint8_t*)(0x4003883CUL))
#define FM4_MFS8_CSIO_TBYTE0                      *((volatile  uint8_t*)(0x4003883CUL))
#define FM_MFS8_CSIO_TBYTE1                       *((volatile  uint8_t*)(0x4003883DUL))
#define FM4_MFS8_CSIO_TBYTE1                      *((volatile  uint8_t*)(0x4003883DUL))
#define FM_MFS8_CSIO_TBYTE2                       *((volatile  uint8_t*)(0x40038840UL))
#define FM4_MFS8_CSIO_TBYTE2                      *((volatile  uint8_t*)(0x40038840UL))
#define FM_MFS8_CSIO_TBYTE3                       *((volatile  uint8_t*)(0x40038841UL))
#define FM4_MFS8_CSIO_TBYTE3                      *((volatile  uint8_t*)(0x40038841UL))

