mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c3xh/common/s6e2c3xh.h
#define bFM_GPIO_PDIR6_P0                         *((volatile  uint8_t *)(0x42DE6300UL))
#define bFM4_GPIO_PDIR6_P0                        *((volatile  uint8_t *)(0x42DE6300UL))
#define bFM_GPIO_PDIR6_P1                         *((volatile  uint8_t *)(0x42DE6304UL))
#define bFM4_GPIO_PDIR6_P1                        *((volatile  uint8_t *)(0x42DE6304UL))
#define bFM_GPIO_PDIR6_P2                         *((volatile  uint8_t *)(0x42DE6308UL))
#define bFM4_GPIO_PDIR6_P2                        *((volatile  uint8_t *)(0x42DE6308UL))
#define bFM_GPIO_PDIR6_P3                         *((volatile  uint8_t *)(0x42DE630CUL))
#define bFM4_GPIO_PDIR6_P3                        *((volatile  uint8_t *)(0x42DE630CUL))
#define bFM_GPIO_PDIR6_PE                         *((volatile  uint8_t *)(0x42DE6338UL))
#define bFM4_GPIO_PDIR6_PE                        *((volatile  uint8_t *)(0x42DE6338UL))

#define bFM_GPIO_PDIR7_P0                         *((volatile  uint8_t *)(0x42DE6380UL))
#define bFM4_GPIO_PDIR7_P0                        *((volatile  uint8_t *)(0x42DE6380UL))
#define bFM_GPIO_PDIR7_P1                         *((volatile  uint8_t *)(0x42DE6384UL))
#define bFM4_GPIO_PDIR7_P1                        *((volatile  uint8_t *)(0x42DE6384UL))
#define bFM_GPIO_PDIR7_P2                         *((volatile  uint8_t *)(0x42DE6388UL))
#define bFM4_GPIO_PDIR7_P2                        *((volatile  uint8_t *)(0x42DE6388UL))
#define bFM_GPIO_PDIR7_P3                         *((volatile  uint8_t *)(0x42DE638CUL))
#define bFM4_GPIO_PDIR7_P3                        *((volatile  uint8_t *)(0x42DE638CUL))
#define bFM_GPIO_PDIR7_P4                         *((volatile  uint8_t *)(0x42DE6390UL))
#define bFM4_GPIO_PDIR7_P4                        *((volatile  uint8_t *)(0x42DE6390UL))
#define bFM_GPIO_PDIR7_P5                         *((volatile  uint8_t *)(0x42DE6394UL))
#define bFM4_GPIO_PDIR7_P5                        *((volatile  uint8_t *)(0x42DE6394UL))
#define bFM_GPIO_PDIR7_P6                         *((volatile  uint8_t *)(0x42DE6398UL))
#define bFM4_GPIO_PDIR7_P6                        *((volatile  uint8_t *)(0x42DE6398UL))
#define bFM_GPIO_PDIR7_P7                         *((volatile  uint8_t *)(0x42DE639CUL))
#define bFM4_GPIO_PDIR7_P7                        *((volatile  uint8_t *)(0x42DE639CUL))
#define bFM_GPIO_PDIR7_P8                         *((volatile  uint8_t *)(0x42DE63A0UL))
#define bFM4_GPIO_PDIR7_P8                        *((volatile  uint8_t *)(0x42DE63A0UL))
#define bFM_GPIO_PDIR7_P9                         *((volatile  uint8_t *)(0x42DE63A4UL))
#define bFM4_GPIO_PDIR7_P9                        *((volatile  uint8_t *)(0x42DE63A4UL))
#define bFM_GPIO_PDIR7_PA                         *((volatile  uint8_t *)(0x42DE63A8UL))
#define bFM4_GPIO_PDIR7_PA                        *((volatile  uint8_t *)(0x42DE63A8UL))
#define bFM_GPIO_PDIR7_PB                         *((volatile  uint8_t *)(0x42DE63ACUL))
#define bFM4_GPIO_PDIR7_PB                        *((volatile  uint8_t *)(0x42DE63ACUL))
#define bFM_GPIO_PDIR7_PC                         *((volatile  uint8_t *)(0x42DE63B0UL))
#define bFM4_GPIO_PDIR7_PC                        *((volatile  uint8_t *)(0x42DE63B0UL))
#define bFM_GPIO_PDIR7_PD                         *((volatile  uint8_t *)(0x42DE63B4UL))
#define bFM4_GPIO_PDIR7_PD                        *((volatile  uint8_t *)(0x42DE63B4UL))
#define bFM_GPIO_PDIR7_PE                         *((volatile  uint8_t *)(0x42DE63B8UL))
#define bFM4_GPIO_PDIR7_PE                        *((volatile  uint8_t *)(0x42DE63B8UL))

#define bFM_GPIO_PDIR8_P0                         *((volatile  uint8_t *)(0x42DE6400UL))
#define bFM4_GPIO_PDIR8_P0                        *((volatile  uint8_t *)(0x42DE6400UL))
#define bFM_GPIO_PDIR8_P1                         *((volatile  uint8_t *)(0x42DE6404UL))
#define bFM4_GPIO_PDIR8_P1                        *((volatile  uint8_t *)(0x42DE6404UL))
#define bFM_GPIO_PDIR8_P2                         *((volatile  uint8_t *)(0x42DE6408UL))
#define bFM4_GPIO_PDIR8_P2                        *((volatile  uint8_t *)(0x42DE6408UL))
#define bFM_GPIO_PDIR8_P3                         *((volatile  uint8_t *)(0x42DE640CUL))
#define bFM4_GPIO_PDIR8_P3                        *((volatile  uint8_t *)(0x42DE640CUL))

#define bFM_GPIO_PDIRA_P0                         *((volatile  uint8_t *)(0x42DE6500UL))
#define bFM4_GPIO_PDIRA_P0                        *((volatile  uint8_t *)(0x42DE6500UL))
#define bFM_GPIO_PDIRA_P1                         *((volatile  uint8_t *)(0x42DE6504UL))
#define bFM4_GPIO_PDIRA_P1                        *((volatile  uint8_t *)(0x42DE6504UL))
#define bFM_GPIO_PDIRA_P2                         *((volatile  uint8_t *)(0x42DE6508UL))
#define bFM4_GPIO_PDIRA_P2                        *((volatile  uint8_t *)(0x42DE6508UL))
#define bFM_GPIO_PDIRA_P3                         *((volatile  uint8_t *)(0x42DE650CUL))
#define bFM4_GPIO_PDIRA_P3                        *((volatile  uint8_t *)(0x42DE650CUL))
#define bFM_GPIO_PDIRA_P4                         *((volatile  uint8_t *)(0x42DE6510UL))
#define bFM4_GPIO_PDIRA_P4                        *((volatile  uint8_t *)(0x42DE6510UL))
#define bFM_GPIO_PDIRA_P5                         *((volatile  uint8_t *)(0x42DE6514UL))
#define bFM4_GPIO_PDIRA_P5                        *((volatile  uint8_t *)(0x42DE6514UL))
#define bFM_GPIO_PDIRA_P6                         *((volatile  uint8_t *)(0x42DE6518UL))
#define bFM4_GPIO_PDIRA_P6                        *((volatile  uint8_t *)(0x42DE6518UL))
#define bFM_GPIO_PDIRA_P7                         *((volatile  uint8_t *)(0x42DE651CUL))
#define bFM4_GPIO_PDIRA_P7                        *((volatile  uint8_t *)(0x42DE651CUL))
#define bFM_GPIO_PDIRA_P8                         *((volatile  uint8_t *)(0x42DE6520UL))
#define bFM4_GPIO_PDIRA_P8                        *((volatile  uint8_t *)(0x42DE6520UL))
#define bFM_GPIO_PDIRA_P9                         *((volatile  uint8_t *)(0x42DE6524UL))
#define bFM4_GPIO_PDIRA_P9                        *((volatile  uint8_t *)(0x42DE6524UL))
#define bFM_GPIO_PDIRA_PA                         *((volatile  uint8_t *)(0x42DE6528UL))
#define bFM4_GPIO_PDIRA_PA                        *((volatile  uint8_t *)(0x42DE6528UL))
#define bFM_GPIO_PDIRA_PB                         *((volatile  uint8_t *)(0x42DE652CUL))
#define bFM4_GPIO_PDIRA_PB                        *((volatile  uint8_t *)(0x42DE652CUL))
#define bFM_GPIO_PDIRA_PC                         *((volatile  uint8_t *)(0x42DE6530UL))
#define bFM4_GPIO_PDIRA_PC                        *((volatile  uint8_t *)(0x42DE6530UL))
#define bFM_GPIO_PDIRA_PD                         *((volatile  uint8_t *)(0x42DE6534UL))
#define bFM4_GPIO_PDIRA_PD                        *((volatile  uint8_t *)(0x42DE6534UL))
#define bFM_GPIO_PDIRA_PE                         *((volatile  uint8_t *)(0x42DE6538UL))
#define bFM4_GPIO_PDIRA_PE                        *((volatile  uint8_t *)(0x42DE6538UL))
#define bFM_GPIO_PDIRA_PF                         *((volatile  uint8_t *)(0x42DE653CUL))
#define bFM4_GPIO_PDIRA_PF                        *((volatile  uint8_t *)(0x42DE653CUL))

#define bFM_GPIO_PDIRC_P0                         *((volatile  uint8_t *)(0x42DE6600UL))
#define bFM4_GPIO_PDIRC_P0                        *((volatile  uint8_t *)(0x42DE6600UL))
#define bFM_GPIO_PDIRC_P1                         *((volatile  uint8_t *)(0x42DE6604UL))
#define bFM4_GPIO_PDIRC_P1                        *((volatile  uint8_t *)(0x42DE6604UL))
#define bFM_GPIO_PDIRC_P2                         *((volatile  uint8_t *)(0x42DE6608UL))
#define bFM4_GPIO_PDIRC_P2                        *((volatile  uint8_t *)(0x42DE6608UL))
#define bFM_GPIO_PDIRC_P3                         *((volatile  uint8_t *)(0x42DE660CUL))
#define bFM4_GPIO_PDIRC_P3                        *((volatile  uint8_t *)(0x42DE660CUL))
#define bFM_GPIO_PDIRC_P4                         *((volatile  uint8_t *)(0x42DE6610UL))
#define bFM4_GPIO_PDIRC_P4                        *((volatile  uint8_t *)(0x42DE6610UL))
#define bFM_GPIO_PDIRC_P5                         *((volatile  uint8_t *)(0x42DE6614UL))
#define bFM4_GPIO_PDIRC_P5                        *((volatile  uint8_t *)(0x42DE6614UL))
#define bFM_GPIO_PDIRC_P6                         *((volatile  uint8_t *)(0x42DE6618UL))
#define bFM4_GPIO_PDIRC_P6                        *((volatile  uint8_t *)(0x42DE6618UL))
#define bFM_GPIO_PDIRC_P7                         *((volatile  uint8_t *)(0x42DE661CUL))
#define bFM4_GPIO_PDIRC_P7                        *((volatile  uint8_t *)(0x42DE661CUL))
#define bFM_GPIO_PDIRC_P8                         *((volatile  uint8_t *)(0x42DE6620UL))
#define bFM4_GPIO_PDIRC_P8                        *((volatile  uint8_t *)(0x42DE6620UL))
#define bFM_GPIO_PDIRC_P9                         *((volatile  uint8_t *)(0x42DE6624UL))
#define bFM4_GPIO_PDIRC_P9                        *((volatile  uint8_t *)(0x42DE6624UL))
#define bFM_GPIO_PDIRC_PA                         *((volatile  uint8_t *)(0x42DE6628UL))
#define bFM4_GPIO_PDIRC_PA                        *((volatile  uint8_t *)(0x42DE6628UL))
#define bFM_GPIO_PDIRC_PB                         *((volatile  uint8_t *)(0x42DE662CUL))
#define bFM4_GPIO_PDIRC_PB                        *((volatile  uint8_t *)(0x42DE662CUL))
#define bFM_GPIO_PDIRC_PC                         *((volatile  uint8_t *)(0x42DE6630UL))
#define bFM4_GPIO_PDIRC_PC                        *((volatile  uint8_t *)(0x42DE6630UL))
#define bFM_GPIO_PDIRC_PD                         *((volatile  uint8_t *)(0x42DE6634UL))
#define bFM4_GPIO_PDIRC_PD                        *((volatile  uint8_t *)(0x42DE6634UL))
#define bFM_GPIO_PDIRC_PE                         *((volatile  uint8_t *)(0x42DE6638UL))
#define bFM4_GPIO_PDIRC_PE                        *((volatile  uint8_t *)(0x42DE6638UL))
#define bFM_GPIO_PDIRC_PF                         *((volatile  uint8_t *)(0x42DE663CUL))
#define bFM4_GPIO_PDIRC_PF                        *((volatile  uint8_t *)(0x42DE663CUL))

#define bFM_GPIO_PDIRD_P0                         *((volatile  uint8_t *)(0x42DE6680UL))
#define bFM4_GPIO_PDIRD_P0                        *((volatile  uint8_t *)(0x42DE6680UL))
#define bFM_GPIO_PDIRD_P1                         *((volatile  uint8_t *)(0x42DE6684UL))
#define bFM4_GPIO_PDIRD_P1                        *((volatile  uint8_t *)(0x42DE6684UL))
#define bFM_GPIO_PDIRD_P2                         *((volatile  uint8_t *)(0x42DE6688UL))
#define bFM4_GPIO_PDIRD_P2                        *((volatile  uint8_t *)(0x42DE6688UL))

#define bFM_GPIO_PDIRE_P0                         *((volatile  uint8_t *)(0x42DE6700UL))
#define bFM4_GPIO_PDIRE_P0                        *((volatile  uint8_t *)(0x42DE6700UL))
#define bFM_GPIO_PDIRE_P2                         *((volatile  uint8_t *)(0x42DE6708UL))
#define bFM4_GPIO_PDIRE_P2                        *((volatile  uint8_t *)(0x42DE6708UL))
#define bFM_GPIO_PDIRE_P3                         *((volatile  uint8_t *)(0x42DE670CUL))
#define bFM4_GPIO_PDIRE_P3                        *((volatile  uint8_t *)(0x42DE670CUL))

#define bFM_GPIO_PDOR0_P0                         *((volatile  uint8_t *)(0x42DE8000UL))
#define bFM4_GPIO_PDOR0_P0                        *((volatile  uint8_t *)(0x42DE8000UL))
#define bFM_GPIO_PDOR0_P1                         *((volatile  uint8_t *)(0x42DE8004UL))
#define bFM4_GPIO_PDOR0_P1                        *((volatile  uint8_t *)(0x42DE8004UL))
#define bFM_GPIO_PDOR0_P2                         *((volatile  uint8_t *)(0x42DE8008UL))
#define bFM4_GPIO_PDOR0_P2                        *((volatile  uint8_t *)(0x42DE8008UL))
#define bFM_GPIO_PDOR0_P3                         *((volatile  uint8_t *)(0x42DE800CUL))
#define bFM4_GPIO_PDOR0_P3                        *((volatile  uint8_t *)(0x42DE800CUL))
#define bFM_GPIO_PDOR0_P4                         *((volatile  uint8_t *)(0x42DE8010UL))
#define bFM4_GPIO_PDOR0_P4                        *((volatile  uint8_t *)(0x42DE8010UL))
#define bFM_GPIO_PDOR0_P8                         *((volatile  uint8_t *)(0x42DE8020UL))
#define bFM4_GPIO_PDOR0_P8                        *((volatile  uint8_t *)(0x42DE8020UL))
#define bFM_GPIO_PDOR0_P9                         *((volatile  uint8_t *)(0x42DE8024UL))
#define bFM4_GPIO_PDOR0_P9                        *((volatile  uint8_t *)(0x42DE8024UL))
#define bFM_GPIO_PDOR0_PA                         *((volatile  uint8_t *)(0x42DE8028UL))
#define bFM4_GPIO_PDOR0_PA                        *((volatile  uint8_t *)(0x42DE8028UL))

#define bFM_GPIO_PDOR1_P0                         *((volatile  uint8_t *)(0x42DE8080UL))
#define bFM4_GPIO_PDOR1_P0                        *((volatile  uint8_t *)(0x42DE8080UL))
#define bFM_GPIO_PDOR1_P1                         *((volatile  uint8_t *)(0x42DE8084UL))
#define bFM4_GPIO_PDOR1_P1                        *((volatile  uint8_t *)(0x42DE8084UL))
#define bFM_GPIO_PDOR1_P2                         *((volatile  uint8_t *)(0x42DE8088UL))
#define bFM4_GPIO_PDOR1_P2                        *((volatile  uint8_t *)(0x42DE8088UL))
#define bFM_GPIO_PDOR1_P3                         *((volatile  uint8_t *)(0x42DE808CUL))
#define bFM4_GPIO_PDOR1_P3                        *((volatile  uint8_t *)(0x42DE808CUL))
#define bFM_GPIO_PDOR1_P4                         *((volatile  uint8_t *)(0x42DE8090UL))
#define bFM4_GPIO_PDOR1_P4                        *((volatile  uint8_t *)(0x42DE8090UL))
#define bFM_GPIO_PDOR1_P5                         *((volatile  uint8_t *)(0x42DE8094UL))
#define bFM4_GPIO_PDOR1_P5                        *((volatile  uint8_t *)(0x42DE8094UL))
#define bFM_GPIO_PDOR1_P6                         *((volatile  uint8_t *)(0x42DE8098UL))
#define bFM4_GPIO_PDOR1_P6                        *((volatile  uint8_t *)(0x42DE8098UL))
#define bFM_GPIO_PDOR1_P7                         *((volatile  uint8_t *)(0x42DE809CUL))
#define bFM4_GPIO_PDOR1_P7                        *((volatile  uint8_t *)(0x42DE809CUL))
#define bFM_GPIO_PDOR1_P8                         *((volatile  uint8_t *)(0x42DE80A0UL))
#define bFM4_GPIO_PDOR1_P8                        *((volatile  uint8_t *)(0x42DE80A0UL))
#define bFM_GPIO_PDOR1_P9                         *((volatile  uint8_t *)(0x42DE80A4UL))
#define bFM4_GPIO_PDOR1_P9                        *((volatile  uint8_t *)(0x42DE80A4UL))
#define bFM_GPIO_PDOR1_PA                         *((volatile  uint8_t *)(0x42DE80A8UL))
#define bFM4_GPIO_PDOR1_PA                        *((volatile  uint8_t *)(0x42DE80A8UL))
#define bFM_GPIO_PDOR1_PB                         *((volatile  uint8_t *)(0x42DE80ACUL))
#define bFM4_GPIO_PDOR1_PB                        *((volatile  uint8_t *)(0x42DE80ACUL))
#define bFM_GPIO_PDOR1_PC                         *((volatile  uint8_t *)(0x42DE80B0UL))
#define bFM4_GPIO_PDOR1_PC                        *((volatile  uint8_t *)(0x42DE80B0UL))
#define bFM_GPIO_PDOR1_PD                         *((volatile  uint8_t *)(0x42DE80B4UL))
#define bFM4_GPIO_PDOR1_PD                        *((volatile  uint8_t *)(0x42DE80B4UL))
#define bFM_GPIO_PDOR1_PE                         *((volatile  uint8_t *)(0x42DE80B8UL))
#define bFM4_GPIO_PDOR1_PE                        *((volatile  uint8_t *)(0x42DE80B8UL))
#define bFM_GPIO_PDOR1_PF                         *((volatile  uint8_t *)(0x42DE80BCUL))
#define bFM4_GPIO_PDOR1_PF                        *((volatile  uint8_t *)(0x42DE80BCUL))

#define bFM_GPIO_PDOR2_P0                         *((volatile  uint8_t *)(0x42DE8100UL))
#define bFM4_GPIO_PDOR2_P0                        *((volatile  uint8_t *)(0x42DE8100UL))
#define bFM_GPIO_PDOR2_P1                         *((volatile  uint8_t *)(0x42DE8104UL))
#define bFM4_GPIO_PDOR2_P1                        *((volatile  uint8_t *)(0x42DE8104UL))
#define bFM_GPIO_PDOR2_P2                         *((volatile  uint8_t *)(0x42DE8108UL))
#define bFM4_GPIO_PDOR2_P2                        *((volatile  uint8_t *)(0x42DE8108UL))
#define bFM_GPIO_PDOR2_P3                         *((volatile  uint8_t *)(0x42DE810CUL))
#define bFM4_GPIO_PDOR2_P3                        *((volatile  uint8_t *)(0x42DE810CUL))
#define bFM_GPIO_PDOR2_P4                         *((volatile  uint8_t *)(0x42DE8110UL))
#define bFM4_GPIO_PDOR2_P4                        *((volatile  uint8_t *)(0x42DE8110UL))
#define bFM_GPIO_PDOR2_P5                         *((volatile  uint8_t *)(0x42DE8114UL))
#define bFM4_GPIO_PDOR2_P5                        *((volatile  uint8_t *)(0x42DE8114UL))
#define bFM_GPIO_PDOR2_P6                         *((volatile  uint8_t *)(0x42DE8118UL))
#define bFM4_GPIO_PDOR2_P6                        *((volatile  uint8_t *)(0x42DE8118UL))
#define bFM_GPIO_PDOR2_P7                         *((volatile  uint8_t *)(0x42DE811CUL))
#define bFM4_GPIO_PDOR2_P7                        *((volatile  uint8_t *)(0x42DE811CUL))
#define bFM_GPIO_PDOR2_P8                         *((volatile  uint8_t *)(0x42DE8120UL))
#define bFM4_GPIO_PDOR2_P8                        *((volatile  uint8_t *)(0x42DE8120UL))
#define bFM_GPIO_PDOR2_P9                         *((volatile  uint8_t *)(0x42DE8124UL))
#define bFM4_GPIO_PDOR2_P9                        *((volatile  uint8_t *)(0x42DE8124UL))
#define bFM_GPIO_PDOR2_PA                         *((volatile  uint8_t *)(0x42DE8128UL))
#define bFM4_GPIO_PDOR2_PA                        *((volatile  uint8_t *)(0x42DE8128UL))

