mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c3xh/common/s6e2c3xh.h
#define bFM_MFS11_I2C_IBSR_BB                     *((volatile  uint8_t *)(0x42716080UL))
#define bFM4_MFS11_I2C_IBSR_BB                    *((volatile  uint8_t *)(0x42716080UL))
#define bFM_MFS11_I2C_IBSR_SPC                    *((volatile  uint8_t *)(0x42716084UL))
#define bFM4_MFS11_I2C_IBSR_SPC                   *((volatile  uint8_t *)(0x42716084UL))
#define bFM_MFS11_I2C_IBSR_RSC                    *((volatile  uint8_t *)(0x42716088UL))
#define bFM4_MFS11_I2C_IBSR_RSC                   *((volatile  uint8_t *)(0x42716088UL))
#define bFM_MFS11_I2C_IBSR_AL                     *((volatile  uint8_t *)(0x4271608CUL))
#define bFM4_MFS11_I2C_IBSR_AL                    *((volatile  uint8_t *)(0x4271608CUL))
#define bFM_MFS11_I2C_IBSR_TRX                    *((volatile  uint8_t *)(0x42716090UL))
#define bFM4_MFS11_I2C_IBSR_TRX                   *((volatile  uint8_t *)(0x42716090UL))
#define bFM_MFS11_I2C_IBSR_RSA                    *((volatile  uint8_t *)(0x42716094UL))
#define bFM4_MFS11_I2C_IBSR_RSA                   *((volatile  uint8_t *)(0x42716094UL))
#define bFM_MFS11_I2C_IBSR_RACK                   *((volatile  uint8_t *)(0x42716098UL))
#define bFM4_MFS11_I2C_IBSR_RACK                  *((volatile  uint8_t *)(0x42716098UL))
#define bFM_MFS11_I2C_IBSR_FBT                    *((volatile  uint8_t *)(0x4271609CUL))
#define bFM4_MFS11_I2C_IBSR_FBT                   *((volatile  uint8_t *)(0x4271609CUL))

#define bFM_MFS11_I2C_ISBA_SAEN                   *((volatile  uint8_t *)(0x4271621CUL))
#define bFM4_MFS11_I2C_ISBA_SAEN                  *((volatile  uint8_t *)(0x4271621CUL))

#define bFM_MFS11_I2C_ISMK_EN                     *((volatile  uint8_t *)(0x4271623CUL))
#define bFM4_MFS11_I2C_ISMK_EN                    *((volatile  uint8_t *)(0x4271623CUL))

#define bFM_MFS11_I2C_SMR_TIE                     *((volatile  uint8_t *)(0x42716008UL))
#define bFM4_MFS11_I2C_SMR_TIE                    *((volatile  uint8_t *)(0x42716008UL))
#define bFM_MFS11_I2C_SMR_RIE                     *((volatile  uint8_t *)(0x4271600CUL))
#define bFM4_MFS11_I2C_SMR_RIE                    *((volatile  uint8_t *)(0x4271600CUL))

#define bFM_MFS11_I2C_SSR_TBI                     *((volatile  uint8_t *)(0x427160A0UL))
#define bFM4_MFS11_I2C_SSR_TBI                    *((volatile  uint8_t *)(0x427160A0UL))
#define bFM_MFS11_I2C_SSR_TDRE                    *((volatile  uint8_t *)(0x427160A4UL))
#define bFM4_MFS11_I2C_SSR_TDRE                   *((volatile  uint8_t *)(0x427160A4UL))
#define bFM_MFS11_I2C_SSR_RDRF                    *((volatile  uint8_t *)(0x427160A8UL))
#define bFM4_MFS11_I2C_SSR_RDRF                   *((volatile  uint8_t *)(0x427160A8UL))
#define bFM_MFS11_I2C_SSR_ORE                     *((volatile  uint8_t *)(0x427160ACUL))
#define bFM4_MFS11_I2C_SSR_ORE                    *((volatile  uint8_t *)(0x427160ACUL))
#define bFM_MFS11_I2C_SSR_TBIE                    *((volatile  uint8_t *)(0x427160B0UL))
#define bFM4_MFS11_I2C_SSR_TBIE                   *((volatile  uint8_t *)(0x427160B0UL))
#define bFM_MFS11_I2C_SSR_DMA                     *((volatile  uint8_t *)(0x427160B4UL))
#define bFM4_MFS11_I2C_SSR_DMA                    *((volatile  uint8_t *)(0x427160B4UL))
#define bFM_MFS11_I2C_SSR_TSET                    *((volatile  uint8_t *)(0x427160B8UL))
#define bFM4_MFS11_I2C_SSR_TSET                   *((volatile  uint8_t *)(0x427160B8UL))
#define bFM_MFS11_I2C_SSR_REC                     *((volatile  uint8_t *)(0x427160BCUL))
#define bFM4_MFS11_I2C_SSR_REC                    *((volatile  uint8_t *)(0x427160BCUL))

#define bFM_MFS11_LIN_BGR_EXT                     *((volatile  uint8_t *)(0x427161BCUL))
#define bFM4_MFS11_LIN_BGR_EXT                    *((volatile  uint8_t *)(0x427161BCUL))

#define bFM_MFS11_LIN_ESCR_LBIE                   *((volatile  uint8_t *)(0x42716090UL))
#define bFM4_MFS11_LIN_ESCR_LBIE                  *((volatile  uint8_t *)(0x42716090UL))
#define bFM_MFS11_LIN_ESCR_ESBL                   *((volatile  uint8_t *)(0x42716098UL))
#define bFM4_MFS11_LIN_ESCR_ESBL                  *((volatile  uint8_t *)(0x42716098UL))

#define bFM_MFS11_LIN_FCR_FE1                     *((volatile  uint8_t *)(0x42716280UL))
#define bFM4_MFS11_LIN_FCR_FE1                    *((volatile  uint8_t *)(0x42716280UL))
#define bFM_MFS11_LIN_FCR_FE2                     *((volatile  uint8_t *)(0x42716284UL))
#define bFM4_MFS11_LIN_FCR_FE2                    *((volatile  uint8_t *)(0x42716284UL))
#define bFM_MFS11_LIN_FCR_FCL1                    *((volatile  uint8_t *)(0x42716288UL))
#define bFM4_MFS11_LIN_FCR_FCL1                   *((volatile  uint8_t *)(0x42716288UL))
#define bFM_MFS11_LIN_FCR_FCL2                    *((volatile  uint8_t *)(0x4271628CUL))
#define bFM4_MFS11_LIN_FCR_FCL2                   *((volatile  uint8_t *)(0x4271628CUL))
#define bFM_MFS11_LIN_FCR_FSET                    *((volatile  uint8_t *)(0x42716290UL))
#define bFM4_MFS11_LIN_FCR_FSET                   *((volatile  uint8_t *)(0x42716290UL))
#define bFM_MFS11_LIN_FCR_FLD                     *((volatile  uint8_t *)(0x42716294UL))
#define bFM4_MFS11_LIN_FCR_FLD                    *((volatile  uint8_t *)(0x42716294UL))
#define bFM_MFS11_LIN_FCR_FLST                    *((volatile  uint8_t *)(0x42716298UL))
#define bFM4_MFS11_LIN_FCR_FLST                   *((volatile  uint8_t *)(0x42716298UL))
#define bFM_MFS11_LIN_FCR_FSEL                    *((volatile  uint8_t *)(0x427162A0UL))
#define bFM4_MFS11_LIN_FCR_FSEL                   *((volatile  uint8_t *)(0x427162A0UL))
#define bFM_MFS11_LIN_FCR_FTIE                    *((volatile  uint8_t *)(0x427162A4UL))
#define bFM4_MFS11_LIN_FCR_FTIE                   *((volatile  uint8_t *)(0x427162A4UL))
#define bFM_MFS11_LIN_FCR_FDRQ                    *((volatile  uint8_t *)(0x427162A8UL))
#define bFM4_MFS11_LIN_FCR_FDRQ                   *((volatile  uint8_t *)(0x427162A8UL))
#define bFM_MFS11_LIN_FCR_FRIIE                   *((volatile  uint8_t *)(0x427162ACUL))
#define bFM4_MFS11_LIN_FCR_FRIIE                  *((volatile  uint8_t *)(0x427162ACUL))
#define bFM_MFS11_LIN_FCR_FLSTE                   *((volatile  uint8_t *)(0x427162B0UL))
#define bFM4_MFS11_LIN_FCR_FLSTE                  *((volatile  uint8_t *)(0x427162B0UL))

#define bFM_MFS11_LIN_SCR_TXE                     *((volatile  uint8_t *)(0x42716020UL))
#define bFM4_MFS11_LIN_SCR_TXE                    *((volatile  uint8_t *)(0x42716020UL))
#define bFM_MFS11_LIN_SCR_RXE                     *((volatile  uint8_t *)(0x42716024UL))
#define bFM4_MFS11_LIN_SCR_RXE                    *((volatile  uint8_t *)(0x42716024UL))
#define bFM_MFS11_LIN_SCR_TBIE                    *((volatile  uint8_t *)(0x42716028UL))
#define bFM4_MFS11_LIN_SCR_TBIE                   *((volatile  uint8_t *)(0x42716028UL))
#define bFM_MFS11_LIN_SCR_TIE                     *((volatile  uint8_t *)(0x4271602CUL))
#define bFM4_MFS11_LIN_SCR_TIE                    *((volatile  uint8_t *)(0x4271602CUL))
#define bFM_MFS11_LIN_SCR_RIE                     *((volatile  uint8_t *)(0x42716030UL))
#define bFM4_MFS11_LIN_SCR_RIE                    *((volatile  uint8_t *)(0x42716030UL))
#define bFM_MFS11_LIN_SCR_LBR                     *((volatile  uint8_t *)(0x42716034UL))
#define bFM4_MFS11_LIN_SCR_LBR                    *((volatile  uint8_t *)(0x42716034UL))
#define bFM_MFS11_LIN_SCR_MS                      *((volatile  uint8_t *)(0x42716038UL))
#define bFM4_MFS11_LIN_SCR_MS                     *((volatile  uint8_t *)(0x42716038UL))
#define bFM_MFS11_LIN_SCR_UPCL                    *((volatile  uint8_t *)(0x4271603CUL))
#define bFM4_MFS11_LIN_SCR_UPCL                   *((volatile  uint8_t *)(0x4271603CUL))

