mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c3xh/common/s6e2c3xh.h
#define bFM_MFS13_CSIO_SACSR_TMRE                 *((volatile  uint8_t *)(0x4271A480UL))
#define bFM4_MFS13_CSIO_SACSR_TMRE                *((volatile  uint8_t *)(0x4271A480UL))
#define bFM_MFS13_CSIO_SACSR_TSYNE                *((volatile  uint8_t *)(0x4271A498UL))
#define bFM4_MFS13_CSIO_SACSR_TSYNE               *((volatile  uint8_t *)(0x4271A498UL))
#define bFM_MFS13_CSIO_SACSR_TINTE                *((volatile  uint8_t *)(0x4271A49CUL))
#define bFM4_MFS13_CSIO_SACSR_TINTE               *((volatile  uint8_t *)(0x4271A49CUL))
#define bFM_MFS13_CSIO_SACSR_TINT                 *((volatile  uint8_t *)(0x4271A4A0UL))
#define bFM4_MFS13_CSIO_SACSR_TINT                *((volatile  uint8_t *)(0x4271A4A0UL))
#define bFM_MFS13_CSIO_SACSR_CSE                  *((volatile  uint8_t *)(0x4271A4ACUL))
#define bFM4_MFS13_CSIO_SACSR_CSE                 *((volatile  uint8_t *)(0x4271A4ACUL))
#define bFM_MFS13_CSIO_SACSR_CSEIE                *((volatile  uint8_t *)(0x4271A4B0UL))
#define bFM4_MFS13_CSIO_SACSR_CSEIE               *((volatile  uint8_t *)(0x4271A4B0UL))
#define bFM_MFS13_CSIO_SACSR_TBEEN                *((volatile  uint8_t *)(0x4271A4B4UL))
#define bFM4_MFS13_CSIO_SACSR_TBEEN               *((volatile  uint8_t *)(0x4271A4B4UL))

#define bFM_MFS13_CSIO_SCR_TXE                    *((volatile  uint8_t *)(0x4271A020UL))
#define bFM4_MFS13_CSIO_SCR_TXE                   *((volatile  uint8_t *)(0x4271A020UL))
#define bFM_MFS13_CSIO_SCR_RXE                    *((volatile  uint8_t *)(0x4271A024UL))
#define bFM4_MFS13_CSIO_SCR_RXE                   *((volatile  uint8_t *)(0x4271A024UL))
#define bFM_MFS13_CSIO_SCR_TBIE                   *((volatile  uint8_t *)(0x4271A028UL))
#define bFM4_MFS13_CSIO_SCR_TBIE                  *((volatile  uint8_t *)(0x4271A028UL))
#define bFM_MFS13_CSIO_SCR_TIE                    *((volatile  uint8_t *)(0x4271A02CUL))
#define bFM4_MFS13_CSIO_SCR_TIE                   *((volatile  uint8_t *)(0x4271A02CUL))
#define bFM_MFS13_CSIO_SCR_RIE                    *((volatile  uint8_t *)(0x4271A030UL))
#define bFM4_MFS13_CSIO_SCR_RIE                   *((volatile  uint8_t *)(0x4271A030UL))
#define bFM_MFS13_CSIO_SCR_SPI                    *((volatile  uint8_t *)(0x4271A034UL))
#define bFM4_MFS13_CSIO_SCR_SPI                   *((volatile  uint8_t *)(0x4271A034UL))
#define bFM_MFS13_CSIO_SCR_MS                     *((volatile  uint8_t *)(0x4271A038UL))
#define bFM4_MFS13_CSIO_SCR_MS                    *((volatile  uint8_t *)(0x4271A038UL))
#define bFM_MFS13_CSIO_SCR_UPCL                   *((volatile  uint8_t *)(0x4271A03CUL))
#define bFM4_MFS13_CSIO_SCR_UPCL                  *((volatile  uint8_t *)(0x4271A03CUL))

#define bFM_MFS13_CSIO_SCSCR_CSOE                 *((volatile  uint8_t *)(0x4271A600UL))
#define bFM4_MFS13_CSIO_SCSCR_CSOE                *((volatile  uint8_t *)(0x4271A600UL))
#define bFM_MFS13_CSIO_SCSCR_CSEN0                *((volatile  uint8_t *)(0x4271A604UL))
#define bFM4_MFS13_CSIO_SCSCR_CSEN0               *((volatile  uint8_t *)(0x4271A604UL))
#define bFM_MFS13_CSIO_SCSCR_CSEN1                *((volatile  uint8_t *)(0x4271A608UL))
#define bFM4_MFS13_CSIO_SCSCR_CSEN1               *((volatile  uint8_t *)(0x4271A608UL))
#define bFM_MFS13_CSIO_SCSCR_CSEN2                *((volatile  uint8_t *)(0x4271A60CUL))
#define bFM4_MFS13_CSIO_SCSCR_CSEN2               *((volatile  uint8_t *)(0x4271A60CUL))
#define bFM_MFS13_CSIO_SCSCR_CSEN3                *((volatile  uint8_t *)(0x4271A610UL))
#define bFM4_MFS13_CSIO_SCSCR_CSEN3               *((volatile  uint8_t *)(0x4271A610UL))
#define bFM_MFS13_CSIO_SCSCR_CSLVL                *((volatile  uint8_t *)(0x4271A614UL))
#define bFM4_MFS13_CSIO_SCSCR_CSLVL               *((volatile  uint8_t *)(0x4271A614UL))
#define bFM_MFS13_CSIO_SCSCR_SCAM                 *((volatile  uint8_t *)(0x4271A624UL))
#define bFM4_MFS13_CSIO_SCSCR_SCAM                *((volatile  uint8_t *)(0x4271A624UL))

#define bFM_MFS13_CSIO_SCSFR0_CS1SPI              *((volatile  uint8_t *)(0x4271A694UL))
#define bFM4_MFS13_CSIO_SCSFR0_CS1SPI             *((volatile  uint8_t *)(0x4271A694UL))
#define bFM_MFS13_CSIO_SCSFR0_CS1SCINV            *((volatile  uint8_t *)(0x4271A698UL))
#define bFM4_MFS13_CSIO_SCSFR0_CS1SCINV           *((volatile  uint8_t *)(0x4271A698UL))
#define bFM_MFS13_CSIO_SCSFR0_CS1CSLVL            *((volatile  uint8_t *)(0x4271A69CUL))
#define bFM4_MFS13_CSIO_SCSFR0_CS1CSLVL           *((volatile  uint8_t *)(0x4271A69CUL))

#define bFM_MFS13_CSIO_SCSFR1_CS2SPI              *((volatile  uint8_t *)(0x4271A6B4UL))
#define bFM4_MFS13_CSIO_SCSFR1_CS2SPI             *((volatile  uint8_t *)(0x4271A6B4UL))
#define bFM_MFS13_CSIO_SCSFR1_CS2SCINV            *((volatile  uint8_t *)(0x4271A6B8UL))
#define bFM4_MFS13_CSIO_SCSFR1_CS2SCINV           *((volatile  uint8_t *)(0x4271A6B8UL))
#define bFM_MFS13_CSIO_SCSFR1_CS2CSLVL            *((volatile  uint8_t *)(0x4271A6BCUL))
#define bFM4_MFS13_CSIO_SCSFR1_CS2CSLVL           *((volatile  uint8_t *)(0x4271A6BCUL))

#define bFM_MFS13_CSIO_SCSFR2_CS3SPI              *((volatile  uint8_t *)(0x4271A714UL))
#define bFM4_MFS13_CSIO_SCSFR2_CS3SPI             *((volatile  uint8_t *)(0x4271A714UL))
#define bFM_MFS13_CSIO_SCSFR2_CS3SCINV            *((volatile  uint8_t *)(0x4271A718UL))
#define bFM4_MFS13_CSIO_SCSFR2_CS3SCINV           *((volatile  uint8_t *)(0x4271A718UL))
#define bFM_MFS13_CSIO_SCSFR2_CS3CSLVL            *((volatile  uint8_t *)(0x4271A71CUL))
#define bFM4_MFS13_CSIO_SCSFR2_CS3CSLVL           *((volatile  uint8_t *)(0x4271A71CUL))

#define bFM_MFS13_CSIO_SMR_SOE                    *((volatile  uint8_t *)(0x4271A000UL))
#define bFM4_MFS13_CSIO_SMR_SOE                   *((volatile  uint8_t *)(0x4271A000UL))
#define bFM_MFS13_CSIO_SMR_SCKE                   *((volatile  uint8_t *)(0x4271A004UL))
#define bFM4_MFS13_CSIO_SMR_SCKE                  *((volatile  uint8_t *)(0x4271A004UL))
#define bFM_MFS13_CSIO_SMR_BDS                    *((volatile  uint8_t *)(0x4271A008UL))
#define bFM4_MFS13_CSIO_SMR_BDS                   *((volatile  uint8_t *)(0x4271A008UL))
#define bFM_MFS13_CSIO_SMR_SCINV                  *((volatile  uint8_t *)(0x4271A00CUL))
#define bFM4_MFS13_CSIO_SMR_SCINV                 *((volatile  uint8_t *)(0x4271A00CUL))

#define bFM_MFS13_CSIO_SSR_TBI                    *((volatile  uint8_t *)(0x4271A0A0UL))
#define bFM4_MFS13_CSIO_SSR_TBI                   *((volatile  uint8_t *)(0x4271A0A0UL))
#define bFM_MFS13_CSIO_SSR_TDRE                   *((volatile  uint8_t *)(0x4271A0A4UL))
#define bFM4_MFS13_CSIO_SSR_TDRE                  *((volatile  uint8_t *)(0x4271A0A4UL))
#define bFM_MFS13_CSIO_SSR_RDRF                   *((volatile  uint8_t *)(0x4271A0A8UL))
#define bFM4_MFS13_CSIO_SSR_RDRF                  *((volatile  uint8_t *)(0x4271A0A8UL))
#define bFM_MFS13_CSIO_SSR_ORE                    *((volatile  uint8_t *)(0x4271A0ACUL))
#define bFM4_MFS13_CSIO_SSR_ORE                   *((volatile  uint8_t *)(0x4271A0ACUL))
#define bFM_MFS13_CSIO_SSR_AWC                    *((volatile  uint8_t *)(0x4271A0B0UL))
#define bFM4_MFS13_CSIO_SSR_AWC                   *((volatile  uint8_t *)(0x4271A0B0UL))
#define bFM_MFS13_CSIO_SSR_REC                    *((volatile  uint8_t *)(0x4271A0BCUL))
#define bFM4_MFS13_CSIO_SSR_REC                   *((volatile  uint8_t *)(0x4271A0BCUL))

#define bFM_MFS13_I2C_EIBCR_BEC                   *((volatile  uint8_t *)(0x4271A3A0UL))
#define bFM4_MFS13_I2C_EIBCR_BEC                  *((volatile  uint8_t *)(0x4271A3A0UL))
#define bFM_MFS13_I2C_EIBCR_SOCE                  *((volatile  uint8_t *)(0x4271A3A4UL))
#define bFM4_MFS13_I2C_EIBCR_SOCE                 *((volatile  uint8_t *)(0x4271A3A4UL))
#define bFM_MFS13_I2C_EIBCR_SCLC                  *((volatile  uint8_t *)(0x4271A3A8UL))
#define bFM4_MFS13_I2C_EIBCR_SCLC                 *((volatile  uint8_t *)(0x4271A3A8UL))
#define bFM_MFS13_I2C_EIBCR_SDAC                  *((volatile  uint8_t *)(0x4271A3ACUL))
#define bFM4_MFS13_I2C_EIBCR_SDAC                 *((volatile  uint8_t *)(0x4271A3ACUL))
#define bFM_MFS13_I2C_EIBCR_SCLS                  *((volatile  uint8_t *)(0x4271A3B0UL))
#define bFM4_MFS13_I2C_EIBCR_SCLS                 *((volatile  uint8_t *)(0x4271A3B0UL))
#define bFM_MFS13_I2C_EIBCR_SDAS                  *((volatile  uint8_t *)(0x4271A3B4UL))
#define bFM4_MFS13_I2C_EIBCR_SDAS                 *((volatile  uint8_t *)(0x4271A3B4UL))

#define bFM_MFS13_I2C_FCR_FE1                     *((volatile  uint8_t *)(0x4271A280UL))
#define bFM4_MFS13_I2C_FCR_FE1                    *((volatile  uint8_t *)(0x4271A280UL))
#define bFM_MFS13_I2C_FCR_FE2                     *((volatile  uint8_t *)(0x4271A284UL))
#define bFM4_MFS13_I2C_FCR_FE2                    *((volatile  uint8_t *)(0x4271A284UL))
#define bFM_MFS13_I2C_FCR_FCL1                    *((volatile  uint8_t *)(0x4271A288UL))
#define bFM4_MFS13_I2C_FCR_FCL1                   *((volatile  uint8_t *)(0x4271A288UL))
#define bFM_MFS13_I2C_FCR_FCL2                    *((volatile  uint8_t *)(0x4271A28CUL))
#define bFM4_MFS13_I2C_FCR_FCL2                   *((volatile  uint8_t *)(0x4271A28CUL))
#define bFM_MFS13_I2C_FCR_FSET                    *((volatile  uint8_t *)(0x4271A290UL))
#define bFM4_MFS13_I2C_FCR_FSET                   *((volatile  uint8_t *)(0x4271A290UL))
#define bFM_MFS13_I2C_FCR_FLD                     *((volatile  uint8_t *)(0x4271A294UL))
#define bFM4_MFS13_I2C_FCR_FLD                    *((volatile  uint8_t *)(0x4271A294UL))
#define bFM_MFS13_I2C_FCR_FLST                    *((volatile  uint8_t *)(0x4271A298UL))
#define bFM4_MFS13_I2C_FCR_FLST                   *((volatile  uint8_t *)(0x4271A298UL))
#define bFM_MFS13_I2C_FCR_FSEL                    *((volatile  uint8_t *)(0x4271A2A0UL))
#define bFM4_MFS13_I2C_FCR_FSEL                   *((volatile  uint8_t *)(0x4271A2A0UL))
#define bFM_MFS13_I2C_FCR_FTIE                    *((volatile  uint8_t *)(0x4271A2A4UL))
#define bFM4_MFS13_I2C_FCR_FTIE                   *((volatile  uint8_t *)(0x4271A2A4UL))
#define bFM_MFS13_I2C_FCR_FDRQ                    *((volatile  uint8_t *)(0x4271A2A8UL))
#define bFM4_MFS13_I2C_FCR_FDRQ                   *((volatile  uint8_t *)(0x4271A2A8UL))
#define bFM_MFS13_I2C_FCR_FRIIE                   *((volatile  uint8_t *)(0x4271A2ACUL))
#define bFM4_MFS13_I2C_FCR_FRIIE                  *((volatile  uint8_t *)(0x4271A2ACUL))
#define bFM_MFS13_I2C_FCR_FLSTE                   *((volatile  uint8_t *)(0x4271A2B0UL))
#define bFM4_MFS13_I2C_FCR_FLSTE                  *((volatile  uint8_t *)(0x4271A2B0UL))

#define bFM_MFS13_I2C_IBCR_INT                    *((volatile  uint8_t *)(0x4271A020UL))
#define bFM4_MFS13_I2C_IBCR_INT                   *((volatile  uint8_t *)(0x4271A020UL))
#define bFM_MFS13_I2C_IBCR_BER                    *((volatile  uint8_t *)(0x4271A024UL))
#define bFM4_MFS13_I2C_IBCR_BER                   *((volatile  uint8_t *)(0x4271A024UL))
#define bFM_MFS13_I2C_IBCR_INTE                   *((volatile  uint8_t *)(0x4271A028UL))
#define bFM4_MFS13_I2C_IBCR_INTE                  *((volatile  uint8_t *)(0x4271A028UL))
#define bFM_MFS13_I2C_IBCR_CNDE                   *((volatile  uint8_t *)(0x4271A02CUL))
#define bFM4_MFS13_I2C_IBCR_CNDE                  *((volatile  uint8_t *)(0x4271A02CUL))
#define bFM_MFS13_I2C_IBCR_WSEL                   *((volatile  uint8_t *)(0x4271A030UL))
#define bFM4_MFS13_I2C_IBCR_WSEL                  *((volatile  uint8_t *)(0x4271A030UL))
#define bFM_MFS13_I2C_IBCR_ACKE                   *((volatile  uint8_t *)(0x4271A034UL))
#define bFM4_MFS13_I2C_IBCR_ACKE                  *((volatile  uint8_t *)(0x4271A034UL))
#define bFM_MFS13_I2C_IBCR_ACT_SCC                *((volatile  uint8_t *)(0x4271A038UL))
#define bFM4_MFS13_I2C_IBCR_ACT_SCC               *((volatile  uint8_t *)(0x4271A038UL))
#define bFM_MFS13_I2C_IBCR_MSS                    *((volatile  uint8_t *)(0x4271A03CUL))
#define bFM4_MFS13_I2C_IBCR_MSS                   *((volatile  uint8_t *)(0x4271A03CUL))

