mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c3xh/common/s6e2c3xh.h
#define bFM_MFS8_CSIO_SCSFR0_CS1SPI               *((volatile  uint8_t *)(0x42710694UL))
#define bFM4_MFS8_CSIO_SCSFR0_CS1SPI              *((volatile  uint8_t *)(0x42710694UL))
#define bFM_MFS8_CSIO_SCSFR0_CS1SCINV             *((volatile  uint8_t *)(0x42710698UL))
#define bFM4_MFS8_CSIO_SCSFR0_CS1SCINV            *((volatile  uint8_t *)(0x42710698UL))
#define bFM_MFS8_CSIO_SCSFR0_CS1CSLVL             *((volatile  uint8_t *)(0x4271069CUL))
#define bFM4_MFS8_CSIO_SCSFR0_CS1CSLVL            *((volatile  uint8_t *)(0x4271069CUL))

#define bFM_MFS8_CSIO_SCSFR1_CS2SPI               *((volatile  uint8_t *)(0x427106B4UL))
#define bFM4_MFS8_CSIO_SCSFR1_CS2SPI              *((volatile  uint8_t *)(0x427106B4UL))
#define bFM_MFS8_CSIO_SCSFR1_CS2SCINV             *((volatile  uint8_t *)(0x427106B8UL))
#define bFM4_MFS8_CSIO_SCSFR1_CS2SCINV            *((volatile  uint8_t *)(0x427106B8UL))
#define bFM_MFS8_CSIO_SCSFR1_CS2CSLVL             *((volatile  uint8_t *)(0x427106BCUL))
#define bFM4_MFS8_CSIO_SCSFR1_CS2CSLVL            *((volatile  uint8_t *)(0x427106BCUL))

#define bFM_MFS8_CSIO_SCSFR2_CS3SPI               *((volatile  uint8_t *)(0x42710714UL))
#define bFM4_MFS8_CSIO_SCSFR2_CS3SPI              *((volatile  uint8_t *)(0x42710714UL))
#define bFM_MFS8_CSIO_SCSFR2_CS3SCINV             *((volatile  uint8_t *)(0x42710718UL))
#define bFM4_MFS8_CSIO_SCSFR2_CS3SCINV            *((volatile  uint8_t *)(0x42710718UL))
#define bFM_MFS8_CSIO_SCSFR2_CS3CSLVL             *((volatile  uint8_t *)(0x4271071CUL))
#define bFM4_MFS8_CSIO_SCSFR2_CS3CSLVL            *((volatile  uint8_t *)(0x4271071CUL))

#define bFM_MFS8_CSIO_SMR_SOE                     *((volatile  uint8_t *)(0x42710000UL))
#define bFM4_MFS8_CSIO_SMR_SOE                    *((volatile  uint8_t *)(0x42710000UL))
#define bFM_MFS8_CSIO_SMR_SCKE                    *((volatile  uint8_t *)(0x42710004UL))
#define bFM4_MFS8_CSIO_SMR_SCKE                   *((volatile  uint8_t *)(0x42710004UL))
#define bFM_MFS8_CSIO_SMR_BDS                     *((volatile  uint8_t *)(0x42710008UL))
#define bFM4_MFS8_CSIO_SMR_BDS                    *((volatile  uint8_t *)(0x42710008UL))
#define bFM_MFS8_CSIO_SMR_SCINV                   *((volatile  uint8_t *)(0x4271000CUL))
#define bFM4_MFS8_CSIO_SMR_SCINV                  *((volatile  uint8_t *)(0x4271000CUL))

#define bFM_MFS8_CSIO_SSR_TBI                     *((volatile  uint8_t *)(0x427100A0UL))
#define bFM4_MFS8_CSIO_SSR_TBI                    *((volatile  uint8_t *)(0x427100A0UL))
#define bFM_MFS8_CSIO_SSR_TDRE                    *((volatile  uint8_t *)(0x427100A4UL))
#define bFM4_MFS8_CSIO_SSR_TDRE                   *((volatile  uint8_t *)(0x427100A4UL))
#define bFM_MFS8_CSIO_SSR_RDRF                    *((volatile  uint8_t *)(0x427100A8UL))
#define bFM4_MFS8_CSIO_SSR_RDRF                   *((volatile  uint8_t *)(0x427100A8UL))
#define bFM_MFS8_CSIO_SSR_ORE                     *((volatile  uint8_t *)(0x427100ACUL))
#define bFM4_MFS8_CSIO_SSR_ORE                    *((volatile  uint8_t *)(0x427100ACUL))
#define bFM_MFS8_CSIO_SSR_AWC                     *((volatile  uint8_t *)(0x427100B0UL))
#define bFM4_MFS8_CSIO_SSR_AWC                    *((volatile  uint8_t *)(0x427100B0UL))
#define bFM_MFS8_CSIO_SSR_REC                     *((volatile  uint8_t *)(0x427100BCUL))
#define bFM4_MFS8_CSIO_SSR_REC                    *((volatile  uint8_t *)(0x427100BCUL))

#define bFM_MFS8_I2C_EIBCR_BEC                    *((volatile  uint8_t *)(0x427103A0UL))
#define bFM4_MFS8_I2C_EIBCR_BEC                   *((volatile  uint8_t *)(0x427103A0UL))
#define bFM_MFS8_I2C_EIBCR_SOCE                   *((volatile  uint8_t *)(0x427103A4UL))
#define bFM4_MFS8_I2C_EIBCR_SOCE                  *((volatile  uint8_t *)(0x427103A4UL))
#define bFM_MFS8_I2C_EIBCR_SCLC                   *((volatile  uint8_t *)(0x427103A8UL))
#define bFM4_MFS8_I2C_EIBCR_SCLC                  *((volatile  uint8_t *)(0x427103A8UL))
#define bFM_MFS8_I2C_EIBCR_SDAC                   *((volatile  uint8_t *)(0x427103ACUL))
#define bFM4_MFS8_I2C_EIBCR_SDAC                  *((volatile  uint8_t *)(0x427103ACUL))
#define bFM_MFS8_I2C_EIBCR_SCLS                   *((volatile  uint8_t *)(0x427103B0UL))
#define bFM4_MFS8_I2C_EIBCR_SCLS                  *((volatile  uint8_t *)(0x427103B0UL))
#define bFM_MFS8_I2C_EIBCR_SDAS                   *((volatile  uint8_t *)(0x427103B4UL))
#define bFM4_MFS8_I2C_EIBCR_SDAS                  *((volatile  uint8_t *)(0x427103B4UL))

#define bFM_MFS8_I2C_FCR_FE1                      *((volatile  uint8_t *)(0x42710280UL))
#define bFM4_MFS8_I2C_FCR_FE1                     *((volatile  uint8_t *)(0x42710280UL))
#define bFM_MFS8_I2C_FCR_FE2                      *((volatile  uint8_t *)(0x42710284UL))
#define bFM4_MFS8_I2C_FCR_FE2                     *((volatile  uint8_t *)(0x42710284UL))
#define bFM_MFS8_I2C_FCR_FCL1                     *((volatile  uint8_t *)(0x42710288UL))
#define bFM4_MFS8_I2C_FCR_FCL1                    *((volatile  uint8_t *)(0x42710288UL))
#define bFM_MFS8_I2C_FCR_FCL2                     *((volatile  uint8_t *)(0x4271028CUL))
#define bFM4_MFS8_I2C_FCR_FCL2                    *((volatile  uint8_t *)(0x4271028CUL))
#define bFM_MFS8_I2C_FCR_FSET                     *((volatile  uint8_t *)(0x42710290UL))
#define bFM4_MFS8_I2C_FCR_FSET                    *((volatile  uint8_t *)(0x42710290UL))
#define bFM_MFS8_I2C_FCR_FLD                      *((volatile  uint8_t *)(0x42710294UL))
#define bFM4_MFS8_I2C_FCR_FLD                     *((volatile  uint8_t *)(0x42710294UL))
#define bFM_MFS8_I2C_FCR_FLST                     *((volatile  uint8_t *)(0x42710298UL))
#define bFM4_MFS8_I2C_FCR_FLST                    *((volatile  uint8_t *)(0x42710298UL))
#define bFM_MFS8_I2C_FCR_FSEL                     *((volatile  uint8_t *)(0x427102A0UL))
#define bFM4_MFS8_I2C_FCR_FSEL                    *((volatile  uint8_t *)(0x427102A0UL))
#define bFM_MFS8_I2C_FCR_FTIE                     *((volatile  uint8_t *)(0x427102A4UL))
#define bFM4_MFS8_I2C_FCR_FTIE                    *((volatile  uint8_t *)(0x427102A4UL))
#define bFM_MFS8_I2C_FCR_FDRQ                     *((volatile  uint8_t *)(0x427102A8UL))
#define bFM4_MFS8_I2C_FCR_FDRQ                    *((volatile  uint8_t *)(0x427102A8UL))
#define bFM_MFS8_I2C_FCR_FRIIE                    *((volatile  uint8_t *)(0x427102ACUL))
#define bFM4_MFS8_I2C_FCR_FRIIE                   *((volatile  uint8_t *)(0x427102ACUL))
#define bFM_MFS8_I2C_FCR_FLSTE                    *((volatile  uint8_t *)(0x427102B0UL))
#define bFM4_MFS8_I2C_FCR_FLSTE                   *((volatile  uint8_t *)(0x427102B0UL))

#define bFM_MFS8_I2C_IBCR_INT                     *((volatile  uint8_t *)(0x42710020UL))
#define bFM4_MFS8_I2C_IBCR_INT                    *((volatile  uint8_t *)(0x42710020UL))
#define bFM_MFS8_I2C_IBCR_BER                     *((volatile  uint8_t *)(0x42710024UL))
#define bFM4_MFS8_I2C_IBCR_BER                    *((volatile  uint8_t *)(0x42710024UL))
#define bFM_MFS8_I2C_IBCR_INTE                    *((volatile  uint8_t *)(0x42710028UL))
#define bFM4_MFS8_I2C_IBCR_INTE                   *((volatile  uint8_t *)(0x42710028UL))
#define bFM_MFS8_I2C_IBCR_CNDE                    *((volatile  uint8_t *)(0x4271002CUL))
#define bFM4_MFS8_I2C_IBCR_CNDE                   *((volatile  uint8_t *)(0x4271002CUL))
#define bFM_MFS8_I2C_IBCR_WSEL                    *((volatile  uint8_t *)(0x42710030UL))
#define bFM4_MFS8_I2C_IBCR_WSEL                   *((volatile  uint8_t *)(0x42710030UL))
#define bFM_MFS8_I2C_IBCR_ACKE                    *((volatile  uint8_t *)(0x42710034UL))
#define bFM4_MFS8_I2C_IBCR_ACKE                   *((volatile  uint8_t *)(0x42710034UL))
#define bFM_MFS8_I2C_IBCR_ACT_SCC                 *((volatile  uint8_t *)(0x42710038UL))
#define bFM4_MFS8_I2C_IBCR_ACT_SCC                *((volatile  uint8_t *)(0x42710038UL))
#define bFM_MFS8_I2C_IBCR_MSS                     *((volatile  uint8_t *)(0x4271003CUL))
#define bFM4_MFS8_I2C_IBCR_MSS                    *((volatile  uint8_t *)(0x4271003CUL))

