mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c3xh/common/s6e2c3xh.h
#define bFM_MFT0_WFG_NZCL_DTIEA                   *((volatile  uint16_t*)(0x42403680UL))
#define bFM4_MFT0_WFG_NZCL_DTIEA                  *((volatile  uint16_t*)(0x42403680UL))
#define bFM_MFT0_WFG_NZCL_SDTI                    *((volatile  uint16_t*)(0x42403690UL))
#define bFM4_MFT0_WFG_NZCL_SDTI                   *((volatile  uint16_t*)(0x42403690UL))
#define bFM_MFT0_WFG_NZCL_DTIEB                   *((volatile  uint16_t*)(0x42403694UL))
#define bFM4_MFT0_WFG_NZCL_DTIEB                  *((volatile  uint16_t*)(0x42403694UL))
#define bFM_MFT0_WFG_NZCL_DHOLD                   *((volatile  uint16_t*)(0x4240369CUL))
#define bFM4_MFT0_WFG_NZCL_DHOLD                  *((volatile  uint16_t*)(0x4240369CUL))
#define bFM_MFT0_WFG_NZCL_DIMA                    *((volatile  uint16_t*)(0x424036A0UL))
#define bFM4_MFT0_WFG_NZCL_DIMA                   *((volatile  uint16_t*)(0x424036A0UL))
#define bFM_MFT0_WFG_NZCL_DIMB                    *((volatile  uint16_t*)(0x424036A4UL))
#define bFM4_MFT0_WFG_NZCL_DIMB                   *((volatile  uint16_t*)(0x424036A4UL))
#define bFM_MFT0_WFG_NZCL_WIM10                   *((volatile  uint16_t*)(0x424036B0UL))
#define bFM4_MFT0_WFG_NZCL_WIM10                  *((volatile  uint16_t*)(0x424036B0UL))
#define bFM_MFT0_WFG_NZCL_WIM32                   *((volatile  uint16_t*)(0x424036B4UL))
#define bFM4_MFT0_WFG_NZCL_WIM32                  *((volatile  uint16_t*)(0x424036B4UL))
#define bFM_MFT0_WFG_NZCL_WIM54                   *((volatile  uint16_t*)(0x424036B8UL))
#define bFM4_MFT0_WFG_NZCL_WIM54                  *((volatile  uint16_t*)(0x424036B8UL))

#define bFM_MFT0_WFG_WFIR_DTIFA                   *((volatile  uint16_t*)(0x42403600UL))
#define bFM4_MFT0_WFG_WFIR_DTIFA                  *((volatile  uint16_t*)(0x42403600UL))
#define bFM_MFT0_WFG_WFIR_DTICA                   *((volatile  uint16_t*)(0x42403604UL))
#define bFM4_MFT0_WFG_WFIR_DTICA                  *((volatile  uint16_t*)(0x42403604UL))
#define bFM_MFT0_WFG_WFIR_DTIFB                   *((volatile  uint16_t*)(0x42403608UL))
#define bFM4_MFT0_WFG_WFIR_DTIFB                  *((volatile  uint16_t*)(0x42403608UL))
#define bFM_MFT0_WFG_WFIR_DTICB                   *((volatile  uint16_t*)(0x4240360CUL))
#define bFM4_MFT0_WFG_WFIR_DTICB                  *((volatile  uint16_t*)(0x4240360CUL))
#define bFM_MFT0_WFG_WFIR_TMIF10                  *((volatile  uint16_t*)(0x42403610UL))
#define bFM4_MFT0_WFG_WFIR_TMIF10                 *((volatile  uint16_t*)(0x42403610UL))
#define bFM_MFT0_WFG_WFIR_TMIC10                  *((volatile  uint16_t*)(0x42403614UL))
#define bFM4_MFT0_WFG_WFIR_TMIC10                 *((volatile  uint16_t*)(0x42403614UL))
#define bFM_MFT0_WFG_WFIR_TMIE10                  *((volatile  uint16_t*)(0x42403618UL))
#define bFM4_MFT0_WFG_WFIR_TMIE10                 *((volatile  uint16_t*)(0x42403618UL))
#define bFM_MFT0_WFG_WFIR_TMIS10                  *((volatile  uint16_t*)(0x4240361CUL))
#define bFM4_MFT0_WFG_WFIR_TMIS10                 *((volatile  uint16_t*)(0x4240361CUL))
#define bFM_MFT0_WFG_WFIR_TMIF32                  *((volatile  uint16_t*)(0x42403620UL))
#define bFM4_MFT0_WFG_WFIR_TMIF32                 *((volatile  uint16_t*)(0x42403620UL))
#define bFM_MFT0_WFG_WFIR_TMIC32                  *((volatile  uint16_t*)(0x42403624UL))
#define bFM4_MFT0_WFG_WFIR_TMIC32                 *((volatile  uint16_t*)(0x42403624UL))
#define bFM_MFT0_WFG_WFIR_TMIE32                  *((volatile  uint16_t*)(0x42403628UL))
#define bFM4_MFT0_WFG_WFIR_TMIE32                 *((volatile  uint16_t*)(0x42403628UL))
#define bFM_MFT0_WFG_WFIR_TMIS32                  *((volatile  uint16_t*)(0x4240362CUL))
#define bFM4_MFT0_WFG_WFIR_TMIS32                 *((volatile  uint16_t*)(0x4240362CUL))
#define bFM_MFT0_WFG_WFIR_TMIF54                  *((volatile  uint16_t*)(0x42403630UL))
#define bFM4_MFT0_WFG_WFIR_TMIF54                 *((volatile  uint16_t*)(0x42403630UL))
#define bFM_MFT0_WFG_WFIR_TMIC54                  *((volatile  uint16_t*)(0x42403634UL))
#define bFM4_MFT0_WFG_WFIR_TMIC54                 *((volatile  uint16_t*)(0x42403634UL))
#define bFM_MFT0_WFG_WFIR_TMIE54                  *((volatile  uint16_t*)(0x42403638UL))
#define bFM4_MFT0_WFG_WFIR_TMIE54                 *((volatile  uint16_t*)(0x42403638UL))
#define bFM_MFT0_WFG_WFIR_TMIS54                  *((volatile  uint16_t*)(0x4240363CUL))
#define bFM4_MFT0_WFG_WFIR_TMIS54                 *((volatile  uint16_t*)(0x4240363CUL))


/*******************************************************************************
* MFT Registers MFT1
*   Bitband Section
*******************************************************************************/
#define bFM_MFT1_ADCMP_ACMC0_MZCE                 *((volatile  uint8_t *)(0x42423AD8UL))
#define bFM4_MFT1_ADCMP_ACMC0_MZCE                *((volatile  uint8_t *)(0x42423AD8UL))
#define bFM_MFT1_ADCMP_ACMC0_MPCE                 *((volatile  uint8_t *)(0x42423ADCUL))
#define bFM4_MFT1_ADCMP_ACMC0_MPCE                *((volatile  uint8_t *)(0x42423ADCUL))

#define bFM_MFT1_ADCMP_ACMC1_MZCE                 *((volatile  uint8_t *)(0x42423B58UL))
#define bFM4_MFT1_ADCMP_ACMC1_MZCE                *((volatile  uint8_t *)(0x42423B58UL))
#define bFM_MFT1_ADCMP_ACMC1_MPCE                 *((volatile  uint8_t *)(0x42423B5CUL))
#define bFM4_MFT1_ADCMP_ACMC1_MPCE                *((volatile  uint8_t *)(0x42423B5CUL))

#define bFM_MFT1_ADCMP_ACMC2_MZCE                 *((volatile  uint8_t *)(0x42423BD8UL))
#define bFM4_MFT1_ADCMP_ACMC2_MZCE                *((volatile  uint8_t *)(0x42423BD8UL))
#define bFM_MFT1_ADCMP_ACMC2_MPCE                 *((volatile  uint8_t *)(0x42423BDCUL))
#define bFM4_MFT1_ADCMP_ACMC2_MPCE                *((volatile  uint8_t *)(0x42423BDCUL))

#define bFM_MFT1_ADCMP_ACMC3_MZCE                 *((volatile  uint8_t *)(0x42423C58UL))
#define bFM4_MFT1_ADCMP_ACMC3_MZCE                *((volatile  uint8_t *)(0x42423C58UL))
#define bFM_MFT1_ADCMP_ACMC3_MPCE                 *((volatile  uint8_t *)(0x42423C5CUL))
#define bFM4_MFT1_ADCMP_ACMC3_MPCE                *((volatile  uint8_t *)(0x42423C5CUL))

